{
  "passages": [
    "Eat That Frog \nBY: Brian Tracy \n1 \nTable of Contents \n \nPreface \n \nIntroduction \n \nChapter 1.......................Set the Table \n \nChapter 2.......................Plan Every Day In Advance \n \nChapter 3.......................Apply the 80/20 Rule to Everything \n \nChapter 4.......................Consider the Consequences \n \nChapter 5.......................Practice the ABCDE Method Continually \n \nChapter 6.......................Focus on Key Result Areas \n \nChapter 7.......................Obey the Law of Forced Efficiency \n \nChapter 8.......................Prepare Thoroughly Before You Begin \n \nChapter 9.......................Do Your Homework \n \nChapter 10.....................Leverage Your Special Talents \n \nChapter 11.....................Identify Your Key Constraints \n \nChapter 12............",
    "apter 9.......................Do Your Homework \n \nChapter 10.....................Leverage Your Special Talents \n \nChapter 11.....................Identify Your Key Constraints \n \nChapter 12.....................Take It One Oil Barrel At A Time \n \nChapter 13.....................Put the Pressure on Yourself \n \nChapter 14.....................Maximize Your Personal Power \n \nChapter 15.....................Motivate Yourself Into Action \n \n 2 \nChapter 16.....................Practice Creative Procrastination \n \nChapter 17.....................Do the Most Difficult Task First \n \nChapter 18.....................Slice and Dice the Task \n \nChapter 19.....................Create Large Chunks of Time \n \nChapter 20.....................Develop a Sense of Urgency \n \nChapter 21.....................Single Handle",
    ".....Slice and Dice the Task \n \nChapter 19.....................Create Large Chunks of Time \n \nChapter 20.....................Develop a Sense of Urgency \n \nChapter 21.....................Single Handle Every Task \n \nPutting It All Together \n \n 3 \n               Preface \nThank you for picking up this book. I hope these ideas help you as \nmuch as have helped me and thousands of others. In fact, I hope that \nthis book changes your life forever. \nThere is never enough time to do everything you have to do. You are \nliterally swamped with work and personal responsibilities, projects, \nstacks of magazines to read and piles of books you intend to get to \none of these days as soon as you get caught up. \nBut the fact is that you are never going to get caught up. You will \nnever get on top of your task",
    "nes to read and piles of books you intend to get to \none of these days as soon as you get caught up. \nBut the fact is that you are never going to get caught up. You will \nnever get on top of your tasks. You will never get far enough ahead \nto be able to get to all those books, magazines and leisure time \nactivities that you dream of doing. \nAnd forget about solving your time management problems by \nbecoming more productive. No matter how many personal \nproductivity techniques you master, there will always be more to do \nthan you can ever accomplish in the time you have available to you, \nno matter how much it is.  \nYou can only get control of your time and your life by changing the \nway you think, work and deal with the never ending river of \nresponsibilities that flows over you each day.",
    "tter how much it is.  \nYou can only get control of your time and your life by changing the \nway you think, work and deal with the never ending river of \nresponsibilities that flows over you each day. You can only get \n4 \ncontrol of your tasks and activities to the degree that you stop doing \nsome things and start spending more time on the few things that can \nreally make a difference in your life. \nI have studied time management for more than thirty years. I have \nimmersed myself in the works of Peter Drucker, Alex Mackenzie, \nAlan Lakein, Stephen Covey and many, many others. I have read \nhundreds of books and thousands of articles on personal efficiency \nand effectiveness. This book is the result. \nEach time I came across a good idea, I tried it out in my own work \nand personal life. If i",
    "reds of books and thousands of articles on personal efficiency \nand effectiveness. This book is the result. \nEach time I came across a good idea, I tried it out in my own work \nand personal life. If it worked, I incorporated it into my talks and \nseminars and taught it to others. \nGalileo once wrote, “You cannot teach a person something he does \nnot already know; you can only bring what he does know to his \nawareness.” \nDepending upon your level of knowledge and experience, these ideas \nwill sound familiar. This book will bring them to a higher level of \nawareness. When you learn and apply these methods and techniques \nover and over until they become habits, you will alter the course of \nyou life in a very positive way. \nMy Own Story \n5 \nLet me tell you a little about myself the origins of",
    "se methods and techniques \nover and over until they become habits, you will alter the course of \nyou life in a very positive way. \nMy Own Story \n5 \nLet me tell you a little about myself the origins of this little book. \nI started off in life with few advantages, aside from a curious mind. I \ndid poorly in school and left without graduating. I worked at \nlaboring jobs for several years. My future did not appear promising. \nAs a young man, I got a job on a tramp freighter and went off to see \nthe world. For eight years, I traveled and worked, and then traveled \nsome more, eventually visiting more than eighty countries on five \ncontinents. \nWhen I could no longer find a laboring job, I got into sales, knocking \non doors, working on straight commission. I struggled from sale to \nsale until I b",
    "e than eighty countries on five \ncontinents. \nWhen I could no longer find a laboring job, I got into sales, knocking \non doors, working on straight commission. I struggled from sale to \nsale until I began looking around me and asking, “Why is it that \nother people are doing better than I am?” \nThen I did something that changed my life. I went and asked other \nsuccessful people what they were doing. And they told me. And I did \nwhat they advised me to do, and my sales went up. Eventually, I \nbecame so successful that they made me a sales manager. As a sales \nmanager, I used the same strategy. I found out what other successful \nmanagers were doing and then did it myself. \nThis process of learning and applying what I had learned changed \nmy life. I am still amazed at how simple and obvious it",
    "found out what other successful \nmanagers were doing and then did it myself. \nThis process of learning and applying what I had learned changed \nmy life. I am still amazed at how simple and obvious it is. Just find \n6 \nout what other successful people do and do the same things until you \nget the same results. Wow! What an idea. \nSimply put, some people are doing better than others because they do \nthings differently and they do the right things right. Especially, they \nuse their time far, far better than the average person. \nComing from an unsuccessful background, I had developed deep \nfeelings of inferiority and inadequacy. I had fallen into the mental \ntrap of assuming that people who were doing better than me were \nactually better than me. What I learned was that this was not \nnecessari",
    "s of inferiority and inadequacy. I had fallen into the mental \ntrap of assuming that people who were doing better than me were \nactually better than me. What I learned was that this was not \nnecessarily true. They were just doing things differently, and what \nthey had learned to do, within reason, I could learn as well. \nThis was a revelation to me. I was both amazed and excited with this \ndiscovery. I still am.  I realized that I could change my life and \nachieve almost any goal I could set if I just found out what others \nwere doing in that area and then did it myself until I got the same \nresults they were getting. \nWithin one year of starting in sales, I was a top salesman. A year after \nI was made a manager, I was a vice-president in charge of a 95 person \nsales force in six countries",
    "esults they were getting. \nWithin one year of starting in sales, I was a top salesman. A year after \nI was made a manager, I was a vice-president in charge of a 95 person \nsales force in six countries. I was twenty-five years old. \n7 \nOver the years, I have worked in twenty-two different jobs, started \nand built several companies, earned a business degree from a major \nuniversity, learned to speak French, German and Spanish and been a \nspeaker, trainer or consultant for more than 500 companies. I \ncurrently give talks and seminars to more than 250,000 people each \nyear, with audiences as large as 20,000 people. \nThroughout my career, I have found a simple truth. The ability to \nconcentrate single-mindedly on your most important task, to do it \nwell and to finish it completely, is the key t",
    "as 20,000 people. \nThroughout my career, I have found a simple truth. The ability to \nconcentrate single-mindedly on your most important task, to do it \nwell and to finish it completely, is the key to great success, \nachievement, respect, status and happiness in life. This key insight is \nthe heart and soul of this book.  \nThis book is written to show you how to get ahead more rapidly in \nyour career. These pages contain the twenty-one most powerful \nprinciples on personal effectiveness I have ever discovered.  \nThese methods, techniques and strategies are practical, proven and \nfast acting. In the interests of time, I do not dwell on the various \npsychological or emotional explanations for procrastination or poor \ntime management. There are no lengthy departures into theory or \nresearch.",
    "In the interests of time, I do not dwell on the various \npsychological or emotional explanations for procrastination or poor \ntime management. There are no lengthy departures into theory or \nresearch. What you will learn are specific actions you can take \nimmediately to get better, faster results in your work. \n8 \nEvery idea in this book is focused on increasing your overall levels of \nproductivity, performance and output, on making you more valuable \nin whatever you do. You can apply many of these ideas to your \npersonal life as well. \nEach of these twenty-one methods and techniques is complete in \nitself. All are necessary. One strategy might be effective in one \nsituation and another might apply to another task. All together, these \ntwenty-one ideas represent a smorgasbord of personal e",
    "te in \nitself. All are necessary. One strategy might be effective in one \nsituation and another might apply to another task. All together, these \ntwenty-one ideas represent a smorgasbord of personal effectiveness \ntechniques that you can use at any time, in any order or sequence that \nmakes sense to you at the moment. \nThe key to success is action. These principles work to bring about \nfast, predictable improvements in performance and results. The faster \nyou learn and apply them, the faster you will move ahead in your \ncareer. Guaranteed. \nThere will be no limit to what you can accomplish when you learn \nhow to “Eat That Frog!” \nBrian Tracy \n9 \nIntroduction \nThis is a wonderful time to be alive. There have never been more \npossibilities and opportunities for you to achieve more of your go",
    "n you learn \nhow to “Eat That Frog!” \nBrian Tracy \n9 \nIntroduction \nThis is a wonderful time to be alive. There have never been more \npossibilities and opportunities for you to achieve more of your goals \nthan exist today. As perhaps never before in human history, you are \nactually drowning in options. In fact, there are so many good things \nthat you can do that your ability to decide among them maybe the \ncritical determinant of what you accomplish in life. \nIf you are like most people today, you are overwhelmed with too \nmuch to do and too little time. As you struggle to get caught up, new \ntasks and responsibilities just keep rolling in, like the tides. Because \nof this, you will never be able to do everything you have to do. You \nwill never be caught up. You will always be behind in so",
    "tasks and responsibilities just keep rolling in, like the tides. Because \nof this, you will never be able to do everything you have to do. You \nwill never be caught up. You will always be behind in some of your \ntasks and responsibilities, and probably in many of them. \nFor this reason, and perhaps more than ever before, your ability to \nselect your most important task at each moment, and then to get \nstarted on that task and to get it done both quickly and well, will \nprobably have more of an impact on your success than any other \nquality or skill you can develop.  \nAn average person who develops the habit of setting clear priorities \nand getting important tasks completed quickly will run circles \n10 \naround a genius who talks a lot and makes wonderful plans but who \ngets very little done",
    "lops the habit of setting clear priorities \nand getting important tasks completed quickly will run circles \n10 \naround a genius who talks a lot and makes wonderful plans but who \ngets very little done.  \nIt has been said for many years that if the first thing you do each \nmorning is to eat a live frog, you can go through the day with the \nsatisfaction of knowing that that is probably the worst thing that is \ngoing to happen to you all day long. \nYour \"frog\" is your biggest, most important task, the one you are \nmost likely to procrastinate on if you don't do something about it. \nIt is also the one task that can have the greatest positive impact on \nyour life and results at the moment. \nIt is also been said that, \"If you have to eat two frogs, eat the ugliest \none first.\" \nThis is another w",
    "one task that can have the greatest positive impact on \nyour life and results at the moment. \nIt is also been said that, \"If you have to eat two frogs, eat the ugliest \none first.\" \nThis is another way of saying that, if you have two important tasks \nbefore you, start with the biggest, hardest and most important task \nfirst. Discipline yourself to begin immediately and then to persist \nuntil the task is complete before you go on to something else. \nThink of it as a “test.” Treat it like a personal challenge. Resist the \ntemptation to start with the easier task. Continually remind yourself \nthat one of the most important decisions you make each day is your \n11 \nchoice of what you will do immediately and what you will do later, if \nyou do it at all. \nThere is one final observation. \"If you",
    "at one of the most important decisions you make each day is your \n11 \nchoice of what you will do immediately and what you will do later, if \nyou do it at all. \nThere is one final observation. \"If you have to eat a live frog, it \ndoesn't pay to sit and look at it for very long.\" \nThe key to reaching high levels of performance and productivity is \nfor you to develop the lifelong habit of tackling your major task first \nthing each morning. You must develop the routine of \"Eating your \nfrog\" before you do anything else, and without taking too much time \nto think about it. \nIn study after study of men and women who get paid more and \npromoted faster, the quality of \"action orientation,\" stands out as the \nmost observable and consistent behavior they demonstrate in \neverything they do. Successfu",
    "men and women who get paid more and \npromoted faster, the quality of \"action orientation,\" stands out as the \nmost observable and consistent behavior they demonstrate in \neverything they do. Successful, effective people are those who launch \ndirectly into their major tasks and then discipline themselves to work \nsteadily and single mindedly until those tasks are complete. \nIn our world, and especially in our business world, you are paid and \npromoted for getting specific, measurable results. You are paid for \nmaking a valuable contribution and especially, for making the \ncontribution that is expected of you. \n12 \n\"Failure to execute\" is one of the biggest problems in organizations \ntoday. Many people confuse activity with accomplishment. They talk \ncontinually, hold endless meetings and ma",
    "xpected of you. \n12 \n\"Failure to execute\" is one of the biggest problems in organizations \ntoday. Many people confuse activity with accomplishment. They talk \ncontinually, hold endless meetings and make wonderful plans, but, \nin the final analysis, no one does the job and gets the results required. \nFully 95% of your success in life and work will be determined by the \nkind of habits that you develop over time. The habit of setting \npriorities, overcoming procrastination and getting on with your most \nimportant task is a mental and physical skill. As such, this habit is \nlearnable through practice and repetition, over and over again, until \nit locks into your subconscious mind and becomes a permanent part \nof your behavior. Once it becomes a habit, it becomes both automatic \nand easy to do.",
    "ice and repetition, over and over again, until \nit locks into your subconscious mind and becomes a permanent part \nof your behavior. Once it becomes a habit, it becomes both automatic \nand easy to do. \nYou are designed mentally and emotionally in such a way that task \ncompletion gives you a positive feeling. It makes you happy. It makes \nyou feel like a winner. \nWhenever you complete a task, of any size or importance, you feel a \nsurge of energy, enthusiasm and self-esteem. The more important the \ncompleted task, the happier, more confident and powerful you feel \nabout yourself and your world. \nImportant task completion triggers the release of endorphins in your \nbrain. These endorphins give you a natural “high.” The endorphin \n13 \nrush that follows successful completion of any task makes",
    "Important task completion triggers the release of endorphins in your \nbrain. These endorphins give you a natural “high.” The endorphin \n13 \nrush that follows successful completion of any task makes you feel \nmore creative and confident.  \nHere is one of the most important of the so-called “secrets of \nsuccess.” It is that you can actually develop a \"positive addition\" to \nendorphins and to the feeling of enhanced clarity, confidence and \ncompetence that they trigger. When you develop this “addiction,” \nalmost without thinking you begin to organize your life in such a \nway that you are continually starting and completing ever more \nimportant tasks and projects. You actually become addicted, in a very \npositive sense, to success and contribution. \nOne of the keys to your living a wonderful",
    "ually starting and completing ever more \nimportant tasks and projects. You actually become addicted, in a very \npositive sense, to success and contribution. \nOne of the keys to your living a wonderful life, having a successful \ncareer and feeling terrific about yourself is for you to develop the \nhabit of starting and finishing important jobs. At that point, this \nbehavior takes on a power of its own and you find it easier to \ncomplete important tasks than not to complete them. \nYou remember the story of the man who stops the musician on the \nstreet of New York and asks how he can get to Carnegie Hall. The \nmusician replies, \"Practice, man, practice.\" \nPractice is the key to mastering any skill. Fortunately, your mind is \nlike a muscle. It grows stronger and more capable with use. With \n14",
    "gie Hall. The \nmusician replies, \"Practice, man, practice.\" \nPractice is the key to mastering any skill. Fortunately, your mind is \nlike a muscle. It grows stronger and more capable with use. With \n14 \npractice, you can learn any behavior or develop any habit that you \nconsider either desirable or necessary.  \nYou need three key qualities to develop the habits of focus and \nconcentration. They are all learnable. They are decision, discipline \nand determination.  \nFirst, make a decision to develop the habit of task completion. \nSecond, discipline yourself to practice the principles you are about to \nlearn over and over until you master them. And finally, back \neverything you do with determination until the habit is locked in \nand becomes a permanent part of your personality. \nThere is a spe",
    "t to \nlearn over and over until you master them. And finally, back \neverything you do with determination until the habit is locked in \nand becomes a permanent part of your personality. \nThere is a special way that you can accelerate your progress toward \nbecoming the highly productive, effective, efficient person that you \nwant to be. It consists of your thinking continually about the rewards \nand benefits of being an action oriented, fast moving, focused person. \nSee yourself as the kind of person who gets important jobs done \nquickly and well on a consistent basis. \nYour mental picture of yourself has a powerful effect on your \nbehavior. Visualize yourself as the person you intend to be in the \nfuture. Your self-image, the way you see yourself on the inside,  \nlargely determines your per",
    "urself has a powerful effect on your \nbehavior. Visualize yourself as the person you intend to be in the \nfuture. Your self-image, the way you see yourself on the inside,  \nlargely determines your performance on the outside. As professional \n15 \nspeaker Jim Cathcart says, “The person you see is the person you will \nbe.” \n You have a virtually unlimited ability to learn and develop new \nskills, habits and abilities. When you train yourself, through \nrepetition and practice, to overcome procrastination and get your \nmost important tasks completed quickly, you will move yourself onto \nthe fast track in your life and career and step on the accelerator.  \nEat That Frog! \n16 \nChapter 1 - Set the Table \n“There is one quality that one must possess to win, and that is definiteness \nof purpose, the",
    "ack in your life and career and step on the accelerator.  \nEat That Frog! \n16 \nChapter 1 - Set the Table \n“There is one quality that one must possess to win, and that is definiteness \nof purpose, the knowledge of what one wants and a burning desire to achieve \nit.” ( Napoleon Hill ) \nBefore you can determine your “frog” and get on with eating it, you \nhave to decide exactly what it is you want to accomplish in each area \nof your life. Clarity is the most important concept in personal \nproductivity. The number one reason why some people get more \nwork done faster is because they are absolutely clear about their \ngoals and objectives and they don’t deviate from them. \nThe more clear you are about what you want and what you have to \ndo to achieve it, the easier it is for you to overcome procr",
    "clear about their \ngoals and objectives and they don’t deviate from them. \nThe more clear you are about what you want and what you have to \ndo to achieve it, the easier it is for you to overcome procrastination, \neat your frog and get on with the completion of the task. \nA major reason for procrastination and lack of motivation is \nvagueness, confusion and fuzzy mindedness about what it is you are \nsupposed to do, and in what order and for what reason. You must \navoid this common condition with all your strength by striving for \never greater clarity in everything you do. \nHere is a great rule for success: \"Think on paper.\" \n17 \nOnly about 3% of adults have clear, written goals. These people \naccomplish five and ten times as much as people of equal or better \neducation and ability but who,",
    "for success: \"Think on paper.\" \n17 \nOnly about 3% of adults have clear, written goals. These people \naccomplish five and ten times as much as people of equal or better \neducation and ability but who, for whatever reason, have never taken \nthe time to write out exactly what it is they want. \nThere is a powerful formula for setting and achieving goals that you \ncan use for the rest of your life. It consists of seven simple steps. Any \none of these steps can double and triple your productivity if you are \nnot currently using it. Many of my graduates have increased their \nincomes dramatically in a matter of a few years, or even a few \nmonths, with this simple, seven-part method. \nStep number one: Decide exactly what you want. \n Either decide for yourself or sit down with your boss and discuss",
    "matter of a few years, or even a few \nmonths, with this simple, seven-part method. \nStep number one: Decide exactly what you want. \n Either decide for yourself or sit down with your boss and discuss \nyour goals and objectives until you are absolutely, crystal clear about \nwhat is expected of you and in what order of priority. It is amazing \nhow many people are working away, day after day, on low value \ntasks because they have not had this critical discussion with their \nmanager.  \nRule: “One of the very worst uses of time is to do something very \nwell that need not be done at all.” \n18 \nStephen Covey says that, \"Before you begin scrambling up the ladder \nof success, make sure that it is leaning against the right building.\" \nStep number two: Write it down.  \nThink on paper. When you write",
    "en Covey says that, \"Before you begin scrambling up the ladder \nof success, make sure that it is leaning against the right building.\" \nStep number two: Write it down.  \nThink on paper. When you write your goal down, you crystallize it \nand give it tangible form. You create something that you can touch \nand see. On the other hand, a goal or objective that is not in writing is \nmerely a wish or a fantasy. It has no energy behind it. Unwritten \ngoals lead to confusion, vagueness, misdirection and numerous \nmistakes. \nStep number three: Set a deadline on your goal.  \nA goal or decision without a deadline has no urgency.  It has no real \nbeginning or end. Without a definite deadline accompanied by the \nassignment or acceptance of specific responsibilities for completion, \nyou will naturally pro",
    "eadline has no urgency.  It has no real \nbeginning or end. Without a definite deadline accompanied by the \nassignment or acceptance of specific responsibilities for completion, \nyou will naturally procrastinate and get very little done. \nStep number four: Make a list of everything that you can think of that \nyou are going to have to do to achieve your goal.  \nAs you think of new activities, add them to your list. Keep building \nyour list until it is complete. A list gives you a visual picture of the \nlarger task or objective. It gives you a track to run on. It dramatically \n19 \nincreases the likelihood that you will achieve your goal as you have \ndefined it and on schedule. \nStep number five: Organize the list into a plan.  \nOrganize your list by priority and sequence. Take a few minutes t",
    "ikelihood that you will achieve your goal as you have \ndefined it and on schedule. \nStep number five: Organize the list into a plan.  \nOrganize your list by priority and sequence. Take a few minutes to \ndecide what you need to do first and what you can do later. Decide \nwhat has to be done before something else and what needs to be \ndone afterwards. Even better, lay out your plan visually, in the form \nof a series of boxes and circles on a sheet of paper. You’ll be amazed \nat how much easier it is to achieve your goal when you break it down \ninto individual tasks. \nWith a written goal and an organized plan of action, you will be far \nmore productive and efficient than someone who is carrying his goals \naround in his mind. \nStep number six: Take action on your plan immediately.  \nDo somethi",
    "rganized plan of action, you will be far \nmore productive and efficient than someone who is carrying his goals \naround in his mind. \nStep number six: Take action on your plan immediately.  \nDo something. Do anything. An average plan vigorously executed is \nfar better than a brilliant plan on which nothing is done. For you to \nachieve any kind of success, execution is everything. \nStep number seven: Resolve to do something every single day that \nmoves you toward your major goal. \n20 \nBuild this activity into your daily schedule. Read a specific number of \npages on a key subject. Call on a specific number of prospects or \ncustomers. Engage in a specific period of physical exercise. Learn a \ncertain number of new words in a foreign language. Never miss a \nday. \n Keep pushing forward. Once you",
    "fic number of prospects or \ncustomers. Engage in a specific period of physical exercise. Learn a \ncertain number of new words in a foreign language. Never miss a \nday. \n Keep pushing forward. Once you start moving, keep moving. Don’t \nstop. This decision, this discipline alone, can make you one of the \nmost productive and successful people of your generation.  \nClear written goals have a wonderful effect on your thinking. They \nmotivate you and galvanize you into action. They stimulate your \ncreativity, release your energy and help you to overcome \nprocrastination as much as any other factor. \nGoals are the fuel in the furnace of achievement. The bigger your \ngoals and the clearer they are, the more excited you become about \nachieving them. The more you think about your goals, the greater",
    "Goals are the fuel in the furnace of achievement. The bigger your \ngoals and the clearer they are, the more excited you become about \nachieving them. The more you think about your goals, the greater \nbecomes your inner drive and desire to accomplish them.  \nThink about your goals and review them daily. Every morning when \nyou begin, take action on the most important task you can \naccomplish to achieve your most important goal at the moment.  \n21 \nEat That Frog!  Take a clean sheet of paper right now and make out a \nlist of ten goals you want to accomplish in the next year. Write your \ngoals as though a year has already passed and they are now a reality. \nUse the present tense, positive and personal case so that they are \nimmediately accepted by your subconscious mind.  \nFor example, you w",
    "s though a year has already passed and they are now a reality. \nUse the present tense, positive and personal case so that they are \nimmediately accepted by your subconscious mind.  \nFor example, you would write. “I earn X number of dollars per year.” \nOr “I weigh X number of pounds.” Or “I drive such and such a car.” \nThen, go back over your list of ten goals and select the one goal that, \nif you achieved it, would have the greatest positive impact on your \nlife. Whatever that goal is, write it on a separate sheet of paper, set a \ndeadline, make a plan, take action on your plan and then do \nsomething every single day that moves you toward that goal. This \nexercise alone could change your life! \n22 \nChapter 2 – Plan Every Day In Advance \n“Planning is bringing the future into the present so",
    "mething every single day that moves you toward that goal. This \nexercise alone could change your life! \n22 \nChapter 2 – Plan Every Day In Advance \n“Planning is bringing the future into the present so you can do something \nabout it now.” (Alan Lakein) \nYou have heard the old question, ”How do you eat an elephant? One \nbite at a time!” \nHow do you eat your biggest, ugliest frog? The same way; you break \nit down into specific step-by-step activities and then you start on the \nfirst one. \nYour mind, your ability to think, plan and decide, is your most \npowerful tool for overcoming procrastination and increasing your \nproductivity. Your ability to set your goals, plan and take action on \nthem determines the course of your life. The very act of thinking and \nplanning unlocks your mental powers,",
    "and increasing your \nproductivity. Your ability to set your goals, plan and take action on \nthem determines the course of your life. The very act of thinking and \nplanning unlocks your mental powers, triggers your creativity and \nincreases your mental and physical energies.   \nConversely, as Alex MacKenzie wrote, \"Action without planning is the \ncause of every failure.\" \nYour ability to plan well, in advance of beginning, is a measure of \nyour overall competence. The better the plan you have, the easier it is \n23 \nfor you to overcome procrastination, to get started , to eat your frog \nand then to keep going. \nOne of your top goals at work should be for you to get the highest \npossible return on your investment of mental, emotional and physical \nenergy. The good news is that every minute sp",
    "to keep going. \nOne of your top goals at work should be for you to get the highest \npossible return on your investment of mental, emotional and physical \nenergy. The good news is that every minute spent in planning saves \nas many as ten minutes in execution. It only takes about ten or twelve \nminutes for you to plan out your day, but this small investment of \ntime will save you at least two hours (100-120 minutes) in wasted \ntime and diffused effort throughout the day. \nYou may have heard of the six \"P\" formula. It says, \"Proper Prior \nPlanning Prevents Poor Performance.\"  \nWhen you consider how helpful planning can be in increasing your \nproductivity and performance, it is amazing how few people practice \nit every single day. And planning is really quite simple to do. All you \nneed is a",
    "how helpful planning can be in increasing your \nproductivity and performance, it is amazing how few people practice \nit every single day. And planning is really quite simple to do. All you \nneed is a piece of paper and a pen. The most sophisticated Palm Pilot, \ncomputer program or time planner is based on the same principle. It \nis based on your sitting down and making a list of everything you \nhave to do before you begin. \nAlways work from a list. When something new comes up, add it to \nthe list before you do it. You can increase your productivity and \n24 \noutput by 25% or more from the first day that you begin working \nconsistently from a list. \nMake out your list the night before, at the end of the workday. Move \neverything that you have not yet accomplished onto your list for the \ncomi",
    "day that you begin working \nconsistently from a list. \nMake out your list the night before, at the end of the workday. Move \neverything that you have not yet accomplished onto your list for the \ncoming day and then add everything that you have to do the next \nday. When you make out your list the evening or the night before, \nyour subconscious mind works on your list all night long while you \nsleep. Often you will wake up with great ideas and insights that you \ncan use to get your job done faster and better than you had initially \nthought. \nThe more time you take to make written lists of everything you have \nto do, in advance, the more effective and efficient you will be.  \nThere are different lists that you need for different purposes. First, \nyou should create a master list on which you",
    "thing you have \nto do, in advance, the more effective and efficient you will be.  \nThere are different lists that you need for different purposes. First, \nyou should create a master list on which you write down everything \nyou can think of that you want to do some time in the future. This is \nthe place where you capture every idea that comes to or every new \ntask or responsibility that comes up.  You can then sort out the items \nlater. \nSecond, you should have a monthly list that you make up at the end \nof the month for the month ahead.  This may contain items \ntransferred from your master list.  \n25 \nThird, you should have a weekly list where you plan your entire \nweek in advance. This is a list that is under construction as you go \nthrough the current week.  \nThis discipline of systemati",
    "t.  \n25 \nThird, you should have a weekly list where you plan your entire \nweek in advance. This is a list that is under construction as you go \nthrough the current week.  \nThis discipline of systematic time planning can be very helpful to \nyou. Many people have told me that the habit of taking a couple of \nhours at the end of each week to plan the coming week has increased \ntheir productivity dramatically and changed their lives completely. \nThis technique will work for you as well. \nFinally, you transfer items from your monthly and weekly lists onto \nyour daily list. These are the specific activities that you are going to \naccomplish that day.  \nAs you work through the day, tick off the items on your list as you \ncomplete them. This activity gives you a visual picture of \naccomplishment.",
    "tivities that you are going to \naccomplish that day.  \nAs you work through the day, tick off the items on your list as you \ncomplete them. This activity gives you a visual picture of \naccomplishment. It generates a feeling of success and forward \nmotion.  Seeing yourself working progressively through your list \nmotivates and energizes you. It raises your self-esteem and self\nrespect. Steady, visible progress propels you forward and helps you \nto overcome procrastination.  \nWhen you have a project of any kind, begin by making a list of every \nstep that you will have to complete to finish the project from \n26 \nbeginning to end. Organize the project by priority and sequence. Lay \nit out in front of you on paper or on a computer so that you can see it. \nThen go to work on one task at a time. Y",
    "oject from \n26 \nbeginning to end. Organize the project by priority and sequence. Lay \nit out in front of you on paper or on a computer so that you can see it. \nThen go to work on one task at a time. You will be amazed at how \nmuch you get done in this way. \nAs you work through your lists, you will feel more and more \neffective and powerful. You will feel more in control of your life. You \nwill be naturally motivated to do even more. You will think better \nand more creatively and you will get more and better insights that \nenable you to do your work even faster. \nAs you work steadily through your lists, you will develop a sense of \npositive forward momentum that enables you to overcome \nprocrastination. This feeling of progress gives you more energy and \nkeeps you going throughout the day.",
    "ur lists, you will develop a sense of \npositive forward momentum that enables you to overcome \nprocrastination. This feeling of progress gives you more energy and \nkeeps you going throughout the day. \nOne of the most important rules of personal effectiveness is the 10/90 \nRule. This rule says that the first 10% of time that you spend \nplanning and organizing your work, before you begin, will save you \nas much as 90% of the time in getting the job done once you get \nstarted. You only have to try this rule once to prove it to yourself. \nWhen you plan each day in advance, you find it much easier to get \ngoing and to keep going. The work goes faster and smoother than \n27 \never before. You feel more powerful and competent. You eventually \nbecome unstoppable. \n \nEat That Frog!  Begin today to pl",
    "to get \ngoing and to keep going. The work goes faster and smoother than \n27 \never before. You feel more powerful and competent. You eventually \nbecome unstoppable. \n \nEat That Frog!  Begin today to plan every day, week and month in \nadvance. Take a notepad or sheet of paper and make a list of \neverything you have to do in the next 24 hours. Add to it as new \nitems come up. Make a list of all your projects, the big multi-task jobs \nthat are important to your future.  \n \nLay out each of your major goals, projects or tasks by priority, what \nis most important, and by sequence, what has to be done first, what \ncomes second and so forth. Start with the end in mind and work \nbackward. \n \nThink on paper! Always work from a list. You’ll be amazed at how \nmuch more productive you become, and how mu",
    "first, what \ncomes second and so forth. Start with the end in mind and work \nbackward. \n \nThink on paper! Always work from a list. You’ll be amazed at how \nmuch more productive you become, and how much easier it is to eat \nyour frog. \n \n \n \n 28 \nChapter 3 - Apply the 80/20 Rule to Everything \n“We always have time enough, if we will but use it aright.”  (Wolfgang \nVon Goethe) \nThe 80/20 Rule is one of the most helpful of all concepts of time and \nlife management. It is also called the Pareto Principle after its \nfounder, the Italian economist Vilfredo Pareto, who first wrote about \nit in 1895. Pareto noticed that people in his society seemed to divide \nnaturally into what he called the \"vital few,” the top 20% in terms of \nmoney and influence, and the “trivial many,” the bottom 80%. \nHe la",
    "Pareto noticed that people in his society seemed to divide \nnaturally into what he called the \"vital few,” the top 20% in terms of \nmoney and influence, and the “trivial many,” the bottom 80%. \nHe later discovered that virtually all economic activity was subject to \nthis Pareto Principle as well.  \nFor example, this rule says that 20% of your activities will account for \n80% of your results. 20% of your customers will account for 80% of \nyour sales. 20% of your products or services will account for 80% of \nyour profits. 20% of your tasks will account for 80% of the value of \nwhat you do, and so on. \nThis means that if you have a list of ten items to do, two of those \nitems will turn out to be worth as much or more than the other eight \nitems put together. \n29 \nHere is an interesting disco",
    "so on. \nThis means that if you have a list of ten items to do, two of those \nitems will turn out to be worth as much or more than the other eight \nitems put together. \n29 \nHere is an interesting discovery. Each of these tasks may take the \nsame amount of time to accomplish. But one or two of those tasks \nwill contribute five or ten times the value as any of the others. \nOften, one item on a list of ten things that you have to do can be \nworth more than all the other nine items put together. This task is \ninvariably the frog that you should eat first. \nCan you guess on which items the average person is most likely to \nprocrastinate? The sad fact is that most people procrastinate on the \ntop ten or twenty percent of items that are the most valuable and \nimportant, the “vital few.” They busy",
    "erson is most likely to \nprocrastinate? The sad fact is that most people procrastinate on the \ntop ten or twenty percent of items that are the most valuable and \nimportant, the “vital few.” They busy themselves instead with the \nleast important 80%, the \"trivial many\" that contribute very little to \nresults. \nYou often see people who appear to be busy all day long but they \nseem to accomplish very little. This is almost always because they are \nbusy doing things that are of low value while they procrastinate on \nthe one or two activities that could make a real difference to their \ncompanies and to their careers. \nThe most valuable tasks you can do each day are often the hardest \nand most complex. But the payoff and rewards for completing these \ntasks efficiently can be tremendous. For this",
    "d to their careers. \nThe most valuable tasks you can do each day are often the hardest \nand most complex. But the payoff and rewards for completing these \ntasks efficiently can be tremendous. For this reason, you must \n30 \nadamantly refuse to work on tasks in the bottom 80% while you still \nhave tasks in the top 20% left to be done. \nBefore you begin work, always ask yourself, “Is this task in the top \n20% of my activities or in the bottom  80%?”  \nRule: “Resist the temptation to clear up small things first.”  \nRemember, whatever you choose to do, over and over, eventually \nbecomes a habit that is hard to break. If you choose to start your day \non low value tasks, you soon develop the habit of always starting and \nworking on low value tasks. This is not the kind of habit you want to \ndevel",
    "t is hard to break. If you choose to start your day \non low value tasks, you soon develop the habit of always starting and \nworking on low value tasks. This is not the kind of habit you want to \ndevelop, or keep.  \nThe hardest part of any important task is getting started on it in the \nfirst place. Once you actually begin work on a valuable task, you \nseem to be naturally motivated to continue. There is a part of your \nmind that loves to be busy working on significant tasks that can \nreally make a difference. Your job is to feed this part of your mind \ncontinually. \nJust thinking about starting and finishing an important task motivates \nyou and helps you to overcome procrastination. The fact is that the \namount of time required to complete an important job is often the \nsame as the time re",
    "g and finishing an important task motivates \nyou and helps you to overcome procrastination. The fact is that the \namount of time required to complete an important job is often the \nsame as the time required to do an unimportant job. The difference is \n31 \nthat you get a tremendous feeling of pride and satisfaction from the \ncompletion of something valuable and significant. However, when \nyou complete a low value task, using the same amount of time and \nenergy, you get little or no satisfaction at all. \nTime management is really life management, personal management. \nIt is really taking control over the sequence of events. Time \nmanagement is control over what you do next. And you are always \nfree to choose the task that you will do next. Your ability to choose \nbetween the important and th",
    "over the sequence of events. Time \nmanagement is control over what you do next. And you are always \nfree to choose the task that you will do next. Your ability to choose \nbetween the important and the unimportant is the key determinant of  \nyour success in life and work. \n Effective, productive people discipline themselves to start on the \nmost important task that is before them. They force themselves to eat \nthat frog, whatever it is. As a result, they accomplish vastly more \nthan the average person and are much happier as a result. This \nshould be your way of working as well. \nEat That Frog! Make a list of all the key goals, activities, projects and \nresponsibilities in your life today. Which of them are, or could be, in \nthe top 10% or 20% of tasks that represent, or could represent, 8",
    "! Make a list of all the key goals, activities, projects and \nresponsibilities in your life today. Which of them are, or could be, in \nthe top 10% or 20% of tasks that represent, or could represent, 80% or \n90% of your results?  \n32 \nResolve today that you are going to spend more and more of your \ntime working in those few areas that can really make a difference in \nyou life and career, and less and less time on lower value activities. \n33 \nChapter 4 – Consider the Consequences \n“Every man has become great, every successful man has succeeded, in \nproportion as he has confined his powers to one particular channel.” \n(Orison Swett Marden) \nThe mark of the superior thinker is his or her ability to accurately \npredict the consequences of doing or not doing something. The \npotential consequence",
    "particular channel.” \n(Orison Swett Marden) \nThe mark of the superior thinker is his or her ability to accurately \npredict the consequences of doing or not doing something. The \npotential consequences of any task or activity are the key \ndeterminants of how important it really is to you and to your \ncompany. This way of evaluating the significance of a task is how \nyou determine what your next frog really is. \nDoctor Edward Banfield of Harvard University, after more than 50 \nyears of research, concluded that \"long-time perspective\" is the most \naccurate single predictor of upward social and economic mobility in \nAmerica. Long time perspective turns out to be more important than \nfamily background, education, race, intelligence, connections or \nvirtually any other single factor in determin",
    "conomic mobility in \nAmerica. Long time perspective turns out to be more important than \nfamily background, education, race, intelligence, connections or \nvirtually any other single factor in determining your success in life \nand at work. \nYour attitude toward time, your \"time horizon,\" has an enormous \nimpact on your behavior and your choices. People who take the long \nview of their lives and careers always seem to make much better \n34 \ndecisions about their time and activities than people who give very \nlittle thought to the future. \nRule: \"Long-term thinking improves short-term decision making.\" \nSuccessful people have a clear future orientation. They think five, ten \nand twenty years out into the future. They analyze their choices and \nbehaviors in the present to make sure that they ar",
    "ing.\" \nSuccessful people have a clear future orientation. They think five, ten \nand twenty years out into the future. They analyze their choices and \nbehaviors in the present to make sure that they are consistent with \nthe long-term future that they desire. \nIn your work, having a clear idea of what is really important to you \nin the long-term makes it much easier for you to make better \ndecisions about your priorities in the short-term. \nBy definition, something that is important has long-term potential \nconsequences. Something that is unimportant has few or no long\nterm potential consequences. Before starting on anything, you should \nalways ask yourself, \"What are the potential consequences of doing \nor not doing this task?\" \nRule: \"Future intent influences and often determines present a",
    "s. Before starting on anything, you should \nalways ask yourself, \"What are the potential consequences of doing \nor not doing this task?\" \nRule: \"Future intent influences and often determines present actions.\" \nThe clearer you are about your future intentions, the greater \ninfluence that clarity will have on what you do in the moment. With a \n35 \nclear long-term vision, you are much more capable of evaluating an \nactivity in the present and to assure that it is consistent with where \nyou truly want to end up.  \nSuccessful people are those who are willing to delay gratification and \nmake sacrifices in the short term so that they can enjoy far greater \nrewards in the long term. Unsuccessful people, on the other hand, \nthink more about short-term pleasure and immediate gratification \nwhile giv",
    "ces in the short term so that they can enjoy far greater \nrewards in the long term. Unsuccessful people, on the other hand, \nthink more about short-term pleasure and immediate gratification \nwhile giving little thought to the long-term future. \nDennis Waitley, the motivational speaker, says, \"Failures do what is \ntension relieving while winners do what is goal achieving.\" \nFor example, coming in to work earlier, reading regularly in your \nfield, taking courses to improve your skills, and focusing on high \nvalue tasks in your work will all combine to have an enormous \npositive impact on your future. \nOn the other hand, coming in to work at the last moment, reading the \nnewspaper, drinking coffee and socializing with your coworkers may \nseem fun and enjoyable in the short-term but it inevita",
    "ture. \nOn the other hand, coming in to work at the last moment, reading the \nnewspaper, drinking coffee and socializing with your coworkers may \nseem fun and enjoyable in the short-term but it inevitably leads to \nlack of promotion, underachievement and frustration in the long\nterm. \n36 \nIf there is a task or activity with large potential positive \nconsequences, make it a top priority and get started on it \nimmediately. If there is something that can have large potential \nnegative consequences if it is not done quickly and well, that \nbecomes a top priority as well. Whatever your frog is, resolve to gulp \nit down first thing. \nMotivation requires motive. The greater the positive potential impact \nthat an action or behavior of yours can have on your life, once you \ndefine it clearly, the mo",
    "lve to gulp \nit down first thing. \nMotivation requires motive. The greater the positive potential impact \nthat an action or behavior of yours can have on your life, once you \ndefine it clearly, the more motivated you will be to overcome \nprocrastination and get it done quickly. \nKeep yourself focused and forward moving by continually starting \nand completing those tasks that can make a major difference to your \ncompany and to your future. \nThe time is going to pass anyway. The only question is how you use \nand where you are going to end up at the end of the weeks and \nmonths. And where you end up is largely a matter of the amount of \nconsideration you give to the likely consequences of your actions in \nthe short term. \nThinking continually about the potential consequences of your \nchoices,",
    "up is largely a matter of the amount of \nconsideration you give to the likely consequences of your actions in \nthe short term. \nThinking continually about the potential consequences of your \nchoices, decisions and behaviors is one of the very best ways to \ndetermine you true priorities in your work and personal life. \n37 \nEat That Frog!  Review your list of tasks, activities and projects \nregularly. Continually ask yourself, “Which one project or activity, if \nI did it in an excellent and timely fashion, would have the greatest \npositive impact on my life?” \nWhatever it is that can help you the most, set it as a goal, make a plan \nto achieve it and go to work on your plan immediately. Remember \nthe wonderful words of Goethe, “Just begin and the mind grows heated; \ncontinue, and the task w",
    "he most, set it as a goal, make a plan \nto achieve it and go to work on your plan immediately. Remember \nthe wonderful words of Goethe, “Just begin and the mind grows heated; \ncontinue, and the task will be completed!” \n38 \nChapter 5 - Practice the ABCDE Method Continually \n“The first law of success is concentration – to bend all the energies to one \npoint, and to go directly to that point, looking neither to the right or to the \nleft.” (William Mathews) \nThe more thought you invest in planning and setting priorities before \nyou begin, the more important things you will do and the faster you \nwill get them done once you get started. \nThe more important and valuable the task is to you, the more you \nwill be motivated to overcome procrastination and launch yourself \ninto the job. \nThe ABCDE",
    "will get them done once you get started. \nThe more important and valuable the task is to you, the more you \nwill be motivated to overcome procrastination and launch yourself \ninto the job. \nThe ABCDE Method is a powerful priority setting technique that you \ncan use every single day. This technique is so simple and effective \nthat it can, all by itself, make you one of the most efficient and \neffective people in your field. \nThe power of this technique lies in its simplicity. Here’s how it \nworks: You start with a list of everything you have to do for the \ncoming day.  Think on paper. \nYou then place an A, B, C, D or E before each item on your list before \nyou begin the first task. \n39 \nAn \"A\" item is defined as something that is very important. This is \nsomething that you must do. This is",
    "place an A, B, C, D or E before each item on your list before \nyou begin the first task. \n39 \nAn \"A\" item is defined as something that is very important. This is \nsomething that you must do. This is a task for which there can be \nserious consequences if you do it or fail to do it, like visiting a key \ncustomer or finishing a report for your boss that she needs for an \nupcoming board meeting. These are the frogs of your life. \nIf you have more than one \"A\" task, you prioritize these tasks by \nwriting A-1, A-2, A-3, and so on in front of each item. Your A-1 \ntask is your biggest, ugliest frog of all. \nA \"B\" item is defined as a task that you should do. But it only has mild \nconsequences. These are the tadpoles of your work life. This means \nthat someone may be unhappy or inconvenienced if y",
    "f all. \nA \"B\" item is defined as a task that you should do. But it only has mild \nconsequences. These are the tadpoles of your work life. This means \nthat someone may be unhappy or inconvenienced if you don't do it, \nbut it is nowhere as important as an \"A\" task. Returning an \nunimportant telephone message or reviewing your email would be a \n\"B\" task. \nThe rule is that you should never do a \"B\" task when there is an \"A\" \ntask left undone. You should never be distracted by a tadpole when \nthere is a big frog sitting there waiting to be eaten. \nA \"C\" task is defined as something that would be nice to do, but for \nwhich there are no consequences at all, whether you do it or not. \"C\" \ntasks include phoning a friend, having coffee or lunch with a \n40 \ncoworker or completing some personal busine",
    "ce to do, but for \nwhich there are no consequences at all, whether you do it or not. \"C\" \ntasks include phoning a friend, having coffee or lunch with a \n40 \ncoworker or completing some personal business during work hours. \nThis sort of activity has no affect at all on your work life. \nA \"D\" task is defined as something you can delegate to someone else. \nThe rule is that you should delegate everything that anyone else can \ndo so that you can free up more time for the \"A\" tasks that only you \ncan do. \nAn \"E\" task is defined as something that you can eliminate altogether \nand it won't make any real difference. \nThis may be a task that was important at one time but which is no \nlonger relevant to yourself or anyone else. Often it is something you \ncontinue to do out of habit or because you enj",
    "al difference. \nThis may be a task that was important at one time but which is no \nlonger relevant to yourself or anyone else. Often it is something you \ncontinue to do out of habit or because you enjoy it. \nAfter you have applied the ABCDE Method to your list, you will now \nbe completely organized and ready to get more important things \ndone faster. \nThe key to making this ABCDE Method work is for you to now \ndiscipline yourself to start immediately on your \"A-1\" task and then \nstay at it until it is complete. Use your willpower to get going and \nstay going on this one job, the most important single task you could \npossibly be doing. Eat the whole frog and don’t stop until its finished \ncompletely. \n41 \nYour ability to think through, analyze your work list and determine \nyour \"A-1\" task i",
    "single task you could \npossibly be doing. Eat the whole frog and don’t stop until its finished \ncompletely. \n41 \nYour ability to think through, analyze your work list and determine \nyour \"A-1\" task is the springboard to higher levels of \naccomplishment, and greater self-esteem, self-respect and personal \npride. \nWhen you develop the habit of concentrating on your \"A-1,\" most \nimportant activity, on eating your frog, you will start getting more \ndone than any two or three people around you.  \nEat That Frog! Review you work list right now and put an A, B, C, D \nor E next to each task or activity. Select your A-1 job or project and \nbegin on it immediately. Discipline yourself to do nothing else until \nthis one job is complete. \nPractice this ABCDE Method every day and on every work or proje",
    "y. Select your A-1 job or project and \nbegin on it immediately. Discipline yourself to do nothing else until \nthis one job is complete. \nPractice this ABCDE Method every day and on every work or project \nlist, before you begin work, for the next month. By that time, you will \nhave developed the habit of setting and working on your highest \npriority tasks and your future will be assured! \n42 \nChapter 6 - Focus On Key Result Areas \n“When every physical and mental resource is focused, one’s power to solve a \nproblem multiplies tremendously.” (Norman Vincent Peale) \nWhy are you on the payroll? This is one of the most important \nquestions you ever ask and answer, over and over again, throughout \nyour career. \nAs it happens, most people are not sure exactly why they are on the \npayroll. But if y",
    "s is one of the most important \nquestions you ever ask and answer, over and over again, throughout \nyour career. \nAs it happens, most people are not sure exactly why they are on the \npayroll. But if you are not crystal clear about why it is that you are on \nthe payroll and what results you have been hired to accomplish, it is \nvery hard for you to perform at your best and get paid more and \npromoted faster. \nIn its simplest terms, you have been hired to get specific results. A \nwage or a salary is a payment for a specific quality and quantity of \nwork that can be combined with the work of others to create a \nproduct or service that customers are willing to pay for. \nEach job can be broken down into about five to seven key result \nareas, seldom more. These are the results that you absolutel",
    "rs to create a \nproduct or service that customers are willing to pay for. \nEach job can be broken down into about five to seven key result \nareas, seldom more. These are the results that you absolutely, \npositively have to get to fulfill your responsibilities and make your \nmaximum contribution to your organization. \n43 \nKey result areas are similar to the vital functions of the body, such as \nblood pressure, heart rate, respiratory rate and brainwave activity. \nAn absence of any one of these vital functions leads to the death of \nthe organism. By the same token, your failure to perform in a critical \nresult area of your work can lead to the end of your job as well. \nFor example, the key result areas of management are: Planning, \nOrganizing, Staffing, Delegating, Supervising, Measuring and",
    "ritical \nresult area of your work can lead to the end of your job as well. \nFor example, the key result areas of management are: Planning, \nOrganizing, Staffing, Delegating, Supervising, Measuring and \nReporting. These are the results that a manager must get to succeed \nin his or her area of responsibility. \nThere is essential knowledge and skill that you must have for your \njob. These demands are constantly changing. There are core \ncompetencies that you have developed that make it possible for you \nto do your job in the first place. But there are always key results that \nare central to your work and which determine your success or failure \nin your job. \nA key result area is defined as something for which you are \ncompletely responsible. This means that if you don't do it, it doesn't \nget",
    "work and which determine your success or failure \nin your job. \nA key result area is defined as something for which you are \ncompletely responsible. This means that if you don't do it, it doesn't \nget done. A key result area is an activity that is under your control. It \nis an output of your work that becomes an input or a contributing \nfactor to the work of others. \n44 \nThe starting point of high performance is for you to first of all \nidentify the key result areas of your work. Discuss them with your \nboss. Make a list of your output responsibilities and make sure that \nthe people above you, next to you and below you are in agreement \nwith it. \nFor example, for a salesperson, prospecting and opening new \naccounts is a key result area. This activity is the key to the entire sales \nprocess",
    "next to you and below you are in agreement \nwith it. \nFor example, for a salesperson, prospecting and opening new \naccounts is a key result area. This activity is the key to the entire sales \nprocess. Closing a sale is a key result area. When the sale is made, it \ntriggers the activities of many other people to produce and deliver \nthe product or service. \nFor a company owner or key executive, negotiating a bank loan is a \nkey result area. Hiring the right people and delegating effectively are \nboth key result areas. For a receptionist or secretary, typing a letter or \nanswering the phone and transferring the caller quickly and \nefficiently are defined as key result areas. A person’s ability to \nperform these tasks quickly and well largely determines their pay \nand promotability. \nOnce yo",
    "transferring the caller quickly and \nefficiently are defined as key result areas. A person’s ability to \nperform these tasks quickly and well largely determines their pay \nand promotability. \nOnce you have determined your key result areas, the second step is \nfor you to grade yourself on a scale of 1-10 in each of those areas. \nWhere are you strong and where are you weak? Where are you \ngetting excellent results and where are you underperforming? \n45 \nHere's the rule: Your weakest key result area sets the height at which \nyou can use all your other skills and abilities. \nThis rule says that you could be exceptional in six out of seven key \nresult areas but really poor in the seventh. And your poor \nperformance in the seventh area will hold you back and determine \nhow much you achieve with",
    "ou could be exceptional in six out of seven key \nresult areas but really poor in the seventh. And your poor \nperformance in the seventh area will hold you back and determine \nhow much you achieve with all your other skills. This weakness will \nact as a drag on your effectiveness and be a constant source of friction \nand frustration. \nFor example, delegating is a key result area for a manager. This skill \nis the key leverage point that enables a manager to manage, to get \nresults through others. A manager who cannot delegate properly is \nheld back from using all his or her other skills at their maximum level \nof effectiveness. Poor delegation skills alone can lead to failure in the \njob. \nOne of the major reasons for procrastination and delay in the \nworkplace is that people avoid jobs and",
    "maximum level \nof effectiveness. Poor delegation skills alone can lead to failure in the \njob. \nOne of the major reasons for procrastination and delay in the \nworkplace is that people avoid jobs and activities in those areas \nwhere they have performed poorly in the past. Instead of setting a \ngoal and making a plan to improve in a particular area, most people \navoid that area altogether, which just makes the situation worse. \nThe reverse of this is that, the better you become in a particular skill \narea, the more motivated you will be to perform that function, the \n46 \nless you will procrastinate and the more determined you will be to \nget it finished. \nThe fact is that everybody has both strengths and weaknesses. Refuse \nto rationalize, justify or defend your areas of weakness. Instead,",
    "nate and the more determined you will be to \nget it finished. \nThe fact is that everybody has both strengths and weaknesses. Refuse \nto rationalize, justify or defend your areas of weakness. Instead, \nidentify them clearly. Set a goal and make a plan to become very \ngood in each of those areas. Just think! You may be only one critical \nskill away from top performance at your job. \nHere is one of the greatest questions you will ever ask and answer: \n\"What one skill, if I developed and did it in an excellent fashion, \nwould have the greatest positive impact on my career?\" \nYou should use this question to guide your career for the rest of your \nlife. Look into yourself for the answer. You usually know what it is.  \nAsk your boss this question. Ask your coworkers. Ask your friends \nand your fa",
    "estion to guide your career for the rest of your \nlife. Look into yourself for the answer. You usually know what it is.  \nAsk your boss this question. Ask your coworkers. Ask your friends \nand your family. Whatever it is, find out and then go to work to bring \nup your performance in this area.  \nThe good news is that all business skills are learnable. If anyone else is \nexcellent in that particular key result area, this is proof that you can \nbecome excellent as well, if you decide to. \n47 \nOne of the fastest and best ways to stop procrastinating and get more \nthings done faster is for you to become absolutely excellent in your \nkey result areas. This can be as important as anything else you do in \nyour life or your career. \n \nEat That Frog! Identify the key result areas of your work. What",
    "become absolutely excellent in your \nkey result areas. This can be as important as anything else you do in \nyour life or your career. \n \nEat That Frog! Identify the key result areas of your work. What are \nthey? Write down the key results you have to get to do your job in an \nexcellent fashion. Give yourself a grade from 1-10 on each one. And \nthen determine the one key skill that, if you did it in an excellent \nmanner, would help you the most in your work. \n \nTake this list to your boss and discuss it with him or her. Invite \nhonest feedback and appraisal. You can only get better when you are \nopen to the constructive inputs of other people. Discuss your results \nwith your staff and coworkers. Talk them over with your spouse.  \n \nMake a habit of doing this analysis regularly for the rest",
    "open to the constructive inputs of other people. Discuss your results \nwith your staff and coworkers. Talk them over with your spouse.  \n \nMake a habit of doing this analysis regularly for the rest of your \ncareer. Never stop improving. This decision alone can change your \nlife. \n \n \n \n \n \n \n 48 \nChapter 7 – Obey the Law of Forced Efficiency \n“Concentration, in its truest, unadulterated form, means the ability to focus \nthe mind on one single solitary thing.” (Komar) \nThis law says that, \"There is never enough time to do everything, but \nthere is always enough time to do the most important thing.\" \nPut another way, you cannot eat every tadpole and frog in the pond, \nbut you can eat the biggest and ugliest one, and that will be enough, \nat least for the time being. \nWhen you run out of ti",
    "hing.\" \nPut another way, you cannot eat every tadpole and frog in the pond, \nbut you can eat the biggest and ugliest one, and that will be enough, \nat least for the time being. \nWhen you run out of time and the consequences for non-completion \nof a key task or project can be really serious, you always seem to find \nthe time to get it done, often at the very last minute. You start early, \nyou stay late and you drive yourself to complete the job rather than \nto face the negative consequences that would follow if you didn't get \nit completed within the time limit. \nRule: \"There will never be enough time to do everything you have to \ndo.\" \nThe fact is that the average person today is working at 110% to 130% \nof capacity. And the jobs and responsibilities just keep piling up. \nEveryone has stac",
    "gh time to do everything you have to \ndo.\" \nThe fact is that the average person today is working at 110% to 130% \nof capacity. And the jobs and responsibilities just keep piling up. \nEveryone has stacks of reading material they still have to go through. \n49 \nOne study concluded recently that the average executive has 300-400 \nhours of reading and projects backlogged at home and at the office. \nWhat this means is that you will never be caught up. Get that out of \nyour mind. All you can hope for is to be on top of your most \nimportant responsibilities. The others will just have to wait. \nMany people say that they work better under the pressure of \ndeadlines. Unfortunately, years of research indicate that this is \nseldom true. \nUnder the pressure of deadlines, often self-created through \nproc",
    "ople say that they work better under the pressure of \ndeadlines. Unfortunately, years of research indicate that this is \nseldom true. \nUnder the pressure of deadlines, often self-created through \nprocrastination and delay, people suffer greater stress, make more \nmistakes, and have to do redo more tasks, than under any other \nconditions. Often the mistakes that are made when people are \nworking under tight deadlines lead to defects and cost overruns that \nlead to substantial financial losses in the long-term. Sometimes the \njob actually takes much longer to complete when people rush to get \nthe job done at the last minute and then have to redo it. \nThere are three questions that you can use on a regular basis to keep \nyourself focused on getting your most important tasks completed on \nsche",
    "e job done at the last minute and then have to redo it. \nThere are three questions that you can use on a regular basis to keep \nyourself focused on getting your most important tasks completed on \nschedule. The first question is \"What are my highest value activities?\" \n50 \nPut another way, what are the biggest frogs that you have to eat to \nmake the greatest contribution to your organization? To your family? \nTo your life in general?  \nThis is one of the most important questions you can ask and answer. \nWhat are your highest value activities? First, think this through for \nyourself. Then, ask your boss. Ask your coworkers and subordinates. \nAsk your friends and family. Like focusing the lens of a camera, you \nmust be crystal clear about your highest value activities before you \nbegin work.",
    "our boss. Ask your coworkers and subordinates. \nAsk your friends and family. Like focusing the lens of a camera, you \nmust be crystal clear about your highest value activities before you \nbegin work. \nThe second question you can ask continually is, \"What can I and only I \ndo, that if done well, will make a real difference?\" \nThis question comes from Peter Drucker, the management guru. It is \none of the best of all questions for achieving personal effectiveness. \nWhat can you, and only you do, that if done well, can make a real \ndifference? \nThis is something that only you can do. If you don't do it, it won't be \ndone by someone else. But if you do do it, and you do it well, it can \nreally make a difference to your life and your career. What is your \nfrog in your work? \n51 \nEvery hour of ev",
    "do it, it won't be \ndone by someone else. But if you do do it, and you do it well, it can \nreally make a difference to your life and your career. What is your \nfrog in your work? \n51 \nEvery hour of every day, you can ask yourself this question and there \nwill be a specific answer. You job is to be clear about the answer and \nthen to start and work on this task before anything else. \nThe third question you can ask is \"What is the most valuable use of my \ntime, right now?\" \nWhat is my biggest frog of all at this moment? \nThis is the core question of time management. This is the key to \novercoming procrastination and becoming a highly productive \nperson. Every hour of every day, there is an answer to this question. \nYour job is to ask yourself the question, over and over again, and to \nalways",
    "g procrastination and becoming a highly productive \nperson. Every hour of every day, there is an answer to this question. \nYour job is to ask yourself the question, over and over again, and to \nalways be working on the answer to it, whatever it is. \nDo first things first and second things not at all. As Goethe said, \"The \nthings that matter most must never be at the mercy of the things that matter \nleast.\" \nThe more accurate your answers to these questions, the easier it will \nbe for you to set clear priorities, to overcome procrastination and to \nget started on that one activity that represents the most valuable use \nof your time.  \n52 \nEat That Frog! Your most powerful thinking tool for success is your \nability to discriminate between one priority and another. Take a few \nminutes each da",
    "ts the most valuable use \nof your time.  \n52 \nEat That Frog! Your most powerful thinking tool for success is your \nability to discriminate between one priority and another. Take a few \nminutes each day and sit quietly where you cannot be disturbed. \nDuring this time, let your mind relax and just think about your work \nand activities, without stress or pressure. \nIn almost every case, during this time of solitude, you will receive \nwonderful insights and ideas that will save you enormous amounts \nof time when you apply them back on the job. Often you will \nexperience breakthroughs that will change the direction of your life \nand work. \n53 \nChapter 8 - Prepare Thoroughly Before You Begin \n“No matter what the level of your ability, you have more potential than you \ncan ever develop in a lifet",
    "nge the direction of your life \nand work. \n53 \nChapter 8 - Prepare Thoroughly Before You Begin \n“No matter what the level of your ability, you have more potential than you \ncan ever develop in a lifetime.” (James T. McKay) \nOne of the best ways for you to overcome procrastination and get \nmore things done faster is for you to have everything you need at \nhand before you begin. When you are fully prepared, you are like a \ncocked gun or an archer with an arrow pulled back taut in the bow. \nYou just need one small mental push to get started on your highest \nvalue tasks. \nThis is like getting everything ready to prepare a complete meal, such \nas eating a big frog. You get all the ingredients out on the counter in \nfront of you and then begin putting the dinner together, one step at a \ntime. \nB",
    "ything ready to prepare a complete meal, such \nas eating a big frog. You get all the ingredients out on the counter in \nfront of you and then begin putting the dinner together, one step at a \ntime. \nBegin by clearing off your desk or workspace so that you only have \none task in front of you. If necessary, put everything on the floor or \non the table behind you. Gather all the information, reports, details, \npapers, and work materials that you will require to complete the job. \nHave them at hand so you can reach them without getting up or \nmoving. \n54 \nBe sure that you have all writing materials, computer disks, access \ncodes, email addresses and everything else you need to start and \ncontinue working until the job is done. \nSet up your work area so that it is comfortable, attractive and \nc",
    "s, computer disks, access \ncodes, email addresses and everything else you need to start and \ncontinue working until the job is done. \nSet up your work area so that it is comfortable, attractive and \nconducive to working for long periods. Especially, make sure that \nyou have a comfortable chair that supports your back and allows \nyour feet to sit flat on the floor.  \nThe most productive people take the time to create a work area \nwhere they enjoy spending time. The cleaner and neater your work \narea before you begin, the easier it is for you to get started and keep \ngoing. \nOne of the great techniques for overcoming procrastination (eating \nfrogs) is for you to get everything completely ready to work in \nadvance. When everything is laid out in order and sequence, you feel \nmuch more like ge",
    "hniques for overcoming procrastination (eating \nfrogs) is for you to get everything completely ready to work in \nadvance. When everything is laid out in order and sequence, you feel \nmuch more like getting on with the job.  \nIt is amazing how many books never get written, how many degrees \nnever get completed, how many life changing tasks never get started \nbecause people fail to take the first step of preparing everything in \nadvance. \n55 \nLos Angeles attracts people from all over America who dream of \nwriting a successful movie script and selling it to one of the studios. \nThey move to Los Angeles and work at low level jobs for years while \nthey dream of writing and selling a popular script. \nRecently, the Los Angeles Times sent a reporter out onto Wilshire \nBoulevard to interview passer",
    "ngeles and work at low level jobs for years while \nthey dream of writing and selling a popular script. \nRecently, the Los Angeles Times sent a reporter out onto Wilshire \nBoulevard to interview passers by. When people came along, he \nasked them one question: \"How is your script coming?\" Three out of \nfour passersby replied, \"Almost done!\" \nThe sad fact is that \"almost done\" probably meant \"not yet started.\" \nDon’t let this happen to you. \nWhen you sit down, with everything in front of you, ready to go, \nassume the body language of high performance. Sit up straight, sit \nforward and away from the back of the chair. Carry yourself as \nthough you were an efficient, effective high performing personality. \nThen, pick up the first item and say to yourself, \"Let's get to work!\" \nand plunge in. An",
    "he back of the chair. Carry yourself as \nthough you were an efficient, effective high performing personality. \nThen, pick up the first item and say to yourself, \"Let's get to work!\" \nand plunge in. And once you've started, keep going until the job is \nfinished. \nEat That Frog! Take a good look at your desk or office, both at home \nand at the office. Ask yourself, “What kind of a person works in an \nenvironment like that?” \n56 \nThe cleaner and neater your work environment, the more positive, \nproductive and confident you feel. Resolve today to clean up your \ndesk and office completely so that you feel effective, efficient and \nready to get going each time you sit down to work. \n57 \nChapter 9 - Do Your Homework \n“The only certain means of success is to render more and better service than \nis",
    "ou feel effective, efficient and \nready to get going each time you sit down to work. \n57 \nChapter 9 - Do Your Homework \n“The only certain means of success is to render more and better service than \nis expected of you, no matter what your task may be.” \n(Og Mandino) \nThis is one of the most important personal productivity principles of \nall. Learn what you need to learn so that you can do your work in an \nexcellent fashion. The better you become at eating a particular type of \nfrog, the more likely you are to just plunge in and get it done. \nA major reason for delay and procrastination is a feeling of \ninadequacy, lack of confidence or inability in a key area of the task. A \nsingle area where you feel weak or deficient is enough to discourage \nyou from starting the job at all. \nContinually",
    "ling of \ninadequacy, lack of confidence or inability in a key area of the task. A \nsingle area where you feel weak or deficient is enough to discourage \nyou from starting the job at all. \nContinually upgrade your skills in your key result areas. Remember, \nhowever good you are today, your knowledge and skill is becoming \nobsolete at a rapid rate. As Pat Riley, the basketball coach said, \"If \nyou're not getting better, you're getting worse.\" \nOne of the most helpful of all time management techniques is for you \nto get better at your key tasks. Personal and professional \nimprovement is one of the best time savers there is. The better you \nare at a key task, the more motivated you are to launch into it. The \n58 \nbetter you are, the more energy and enthusiasm you have. When you \nknow that you",
    "e best time savers there is. The better you \nare at a key task, the more motivated you are to launch into it. The \n58 \nbetter you are, the more energy and enthusiasm you have. When you \nknow that you can do a job well, you find it easier to overcome \nprocrastination and get the job done faster and better than under any \nother circumstances. \nOne piece of information or one additional skill can make an \nenormous difference in your ability to do the job well. Identify the \nmost important things you do and then make a plan to continually \nupgrade your skills in those areas.  \nRule: “Continuous learning is the minimum requirement for success \nin any field.” \nRefuse to allow a weakness or a lack of ability in any area to hold you \nback. Everything is learnable. And what others have learned, you",
    "arning is the minimum requirement for success \nin any field.” \nRefuse to allow a weakness or a lack of ability in any area to hold you \nback. Everything is learnable. And what others have learned, you can \nlearn as well.  \nWhen I began to write my first book, I was discouraged because I \ncould only use the “hunt and peck” method of typing. I soon realized \nthat I had to learn to touch-type if I was ever going to write and \nrewrite a 300-page book. So I bought a touch-typing program for my \ncomputer and practiced for 20 to 30 minutes every day for three \nmonths. By the end of that time, I was typing 40-50 words per \nminute. With this skill, I have been able to write a dozen books that \nhave now been published all over the world. \n59 \nThe best news is that you can learn whatever skills you n",
    "yping 40-50 words per \nminute. With this skill, I have been able to write a dozen books that \nhave now been published all over the world. \n59 \nThe best news is that you can learn whatever skills you need to be \nmore productive and more effective. You can become a touch typist if \nnecessary. You can become an expert with a computer. You can \nbecome a terrific negotiator or a super salesperson. You can learn to \nspeak in public. You can learn to write effectively and well. These are \nall skills you can acquire, as soon as you decide to and make them a \npriority. \nRead in your field for at least one hour every day. Get up a little \nearlier in the morning and read for 30-60 minutes in a book or \nmagazine that contains information that can help you to be more \neffective and productive at what y",
    "one hour every day. Get up a little \nearlier in the morning and read for 30-60 minutes in a book or \nmagazine that contains information that can help you to be more \neffective and productive at what you do. \nTake every course and seminar available on key skills that can help \nyou. Attend the conventions and business meetings of your \nprofession or occupation. Go to the sessions and workshops. Sit up \nfront and take notes. Purchase the audio recordings of the programs. \nDedicate yourself to becoming one of the most knowledgeable and \ncompetent people in your field. \nFinally, listen to audio programs in your car. The average car owner \nsits behind the wheel 500-1000 hours each year while driving from \nplace to place. Turn driving time into learning time. You can become \none of the smartest,",
    "grams in your car. The average car owner \nsits behind the wheel 500-1000 hours each year while driving from \nplace to place. Turn driving time into learning time. You can become \none of the smartest, most capable and highest paid people in your \n60 \nfield simply by listening to educational audio programs as you drive \naround. \nThe more you learn and know, the more confident and motivated \nyou feel. You better you become, the more capable you will be of \ndoing even more in your field.  \nThe more you learn, the more you can learn. Just as you can build \nyour physical muscles through physical exercise, you build your \nmental muscles with mental exercises. And there is no limit to how \nfar or how fast you can advance except for the limits you place on \nyour own imagination.  \nEat That Frog! Re",
    "rcise, you build your \nmental muscles with mental exercises. And there is no limit to how \nfar or how fast you can advance except for the limits you place on \nyour own imagination.  \nEat That Frog! Resolve today to become a “Do-It-To-Yourself” \nproject. Become a lifelong student of your craft. School is never out \nfor the professional. \nWhat are the key skills that can help you the most to achieve better \nand faster results? What are the core competencies that you will need \nto have in the future to lead your field? Whatever they are, set a goal, \nmake a plan and begin developing and increasing your ability in \nthose areas. Resolve to be the very best at what you do! \n61 \nChapter 10 - Leverage Your Special Talents \n“Do your work. Not just your work and no more, but a little more for the \nl",
    "g your ability in \nthose areas. Resolve to be the very best at what you do! \n61 \nChapter 10 - Leverage Your Special Talents \n“Do your work. Not just your work and no more, but a little more for the \nlavishings sake – that little more that is worth all the rest.”  \n(Dean Briggs) \nYou are remarkable! You have special talents and abilities that make \nyou different from every other person who has ever lived. There are \nfrogs you can eat, or learn to eat, that can make you one of the most \nimportant people of your generation. \nThere are certain things that you can do, or that you can learn to do, \nthat can make you extraordinarily valuable to yourself and to others. \nYour job is to identify your special areas of uniqueness and then to \ncommit yourself to becoming very, very good in those areas.",
    "that can make you extraordinarily valuable to yourself and to others. \nYour job is to identify your special areas of uniqueness and then to \ncommit yourself to becoming very, very good in those areas.  \nYour most valuable asset, in terms of cash flow, is your \"earning \nability.\" Your ability to work enables you to bring tens of thousands \nof dollars into your life every year by simply applying your \nknowledge and skills to your world. This is your ability to eat specific \nfrogs faster and better than others. \nYou could lose everything you own - your house, your car, your job, \nyour bank account- but as long as you still had your earning ability, \nyou could make it all back and more besides. \n62 \nTake stock of your unique talents and abilities on a regular basis. \nWhat is it that you do esp",
    "t- but as long as you still had your earning ability, \nyou could make it all back and more besides. \n62 \nTake stock of your unique talents and abilities on a regular basis. \nWhat is it that you do especially well? What are you good at? What \ndo you do easily and well that is difficult for other people? Looking \nback at your career, what has been most responsible for your success \nin life and work to date? What have been the most significant frogs \nyou have eaten in the past? \nYou are designed in such a way that you will most enjoy doing the \nvery things that you have the ability to be the very best at. What is it \nthat you enjoy the most about your work? What kind of frogs do you \nmost enjoy eating? The very fact that you enjoy something means \nthat you probably have within yourself the ca",
    "best at. What is it \nthat you enjoy the most about your work? What kind of frogs do you \nmost enjoy eating? The very fact that you enjoy something means \nthat you probably have within yourself the capability to be excellent \nin that area. \nOne of your great responsibilities in life is for you to decide what it is \nthat you really love to do and then to throw your whole heart into \ndoing that special thing very, very well. \nLook at the various things you do. What is it that you do that gets \nyou the most compliments and praise from other people? What do \nyou do that positively affects the work and performance of other \npeople more than anyone else? \n63 \nSuccessful people are invariably those who have taken the time to \nidentify what they do well and most enjoy. They know what they do \nthat",
    "and performance of other \npeople more than anyone else? \n63 \nSuccessful people are invariably those who have taken the time to \nidentify what they do well and most enjoy. They know what they do \nthat really makes a difference in their work, and they then \nconcentrate on that task or area of activity exclusively.  \nYou should always focus your best energies and abilities on starting \nand completing those key tasks where your unique talents and \nabilities enable you to do it well and make a significant contribution. \nYou cannot do everything but you can do those few things in which \nyou excel, the few things that can really make a difference. \nEat That Frog! Continually ask yourself these key questions: “What \nam I really good at? What do I enjoy the most about my work? What \nhas been most",
    "the few things that can really make a difference. \nEat That Frog! Continually ask yourself these key questions: “What \nam I really good at? What do I enjoy the most about my work? What \nhas been most responsible for my success in the past? If I could do \nany job at all, what job would it be?” \nIf you won the lottery or came into an enormous amount of money, \nand you could choose any job or any part of a job to do for the \nindefinite future, what work would you choose? What sort of \npreparation would you have to engage in to be able to do that work \nin an excellent fashion? Whatever your answer, get started today. \n64 \nChapter 11 - Identify Your Key Constraints \n“Concentrate all your thoughts on the task at hand. The sun’s rays do not \nburn until brought to a focus.” \n(Alexander Graham Bell",
    ", get started today. \n64 \nChapter 11 - Identify Your Key Constraints \n“Concentrate all your thoughts on the task at hand. The sun’s rays do not \nburn until brought to a focus.” \n(Alexander Graham Bell) \nWhat is holding you back? What sets the speed at which you achieve \nyour goals? What determines how fast you move from where you are \nto where you want to go? What stops you or holds you back from \neating the frogs that can really make a difference? Why aren’t you at \nyour goal already? \nThese are some of the most important questions you will ever ask \nand answer achieving high levels of personal productivity and \neffectiveness. Whatever you have to do, there is always a limiting \nfactor that determines how quickly and well you get it done. Your job \nis to study the task and identify the li",
    "al productivity and \neffectiveness. Whatever you have to do, there is always a limiting \nfactor that determines how quickly and well you get it done. Your job \nis to study the task and identify the limiting factor or constraint \nwithin it. You must then focus all of your energies on alleviating that \nsingle chokepoint. \nIn virtually every task, large or small, there is a factor that sets the \nspeed at which you achieve the goal or complete the job. What is it? \nConcentrate your mental energies on that one key area. This can be \nthe most valuable use of your time and talents. \n65 \nThis may be a person whose help or decision you need, a resource \nthat you require, a weakness in some part of the organization or \nsomething else. But it the limiting factor always there and it is always \nyour jo",
    "person whose help or decision you need, a resource \nthat you require, a weakness in some part of the organization or \nsomething else. But it the limiting factor always there and it is always \nyour job to find it. \nFor example, the purpose of a business is to create and keep a \ncustomer. By doing this in sufficient quantities, the company makes a \nprofit and continues to grow and flourish. \nIn every business there is a limiting factor or chokepoint that \ndetermines how quickly and well the company achieves this purpose. \nIt may be the marketing, the level of sales or the sales force itself. It \nmay be the costs of operation or the methods of production. It may be \nthe level of cash flow or costs. The success of the company may be \ndetermined by the competition, the customers or the current",
    "may be the costs of operation or the methods of production. It may be \nthe level of cash flow or costs. The success of the company may be \ndetermined by the competition, the customers or the current \nmarketplace. One of these factors, more than anything else, \ndetermines how quickly the company achieves its goals of growth \nand profitability. What is it? \nThe accurate identification of the limiting factor in any process and \nthe focus on that factor can usually bring about more progress in a \nshorter period of time than any other single activity. \nThe 80/20 Rule applies to the constraints in your life and in your \nwork. What this means is that 80% of the constraints, the factors that \n66 \nare holding you back from achieving your goals, are internal. They \nare within yourself, within your",
    "your life and in your \nwork. What this means is that 80% of the constraints, the factors that \n66 \nare holding you back from achieving your goals, are internal. They \nare within yourself, within your own personal qualities, abilities, \nhabits, disciplines or competencies. \nOnly 20% of the limiting factors are external to you or to your \norganization. \nYour key constraint can be something small and not particularly \nobvious. Sometimes it requires that you make a list of every step in \nthe process and examine every activity to determine exactly what it is \nthat is holding you back. Sometimes, it can be a single negative \nperception or objection on the part of the customers that is slowing \ndown the entire sales process. Sometimes it is the absence of a single \nfeature that is holding back t",
    "t can be a single negative \nperception or objection on the part of the customers that is slowing \ndown the entire sales process. Sometimes it is the absence of a single \nfeature that is holding back the growth of sales of a product or \nservice line. \nLook into your company honestly. Look within your boss, your \ncoworkers and members of your staff to see if there is a key weakness \nthat is holding you or the company back, that is acting as a brake on \nthe achievement of your key goals. \nIn your own life, you must have the honesty to look deeply into \nyourself for the limiting factor or limiting skill that sets the speed at \nwhich you achieve your personal goals. \n67 \nSuccessful people always begin the analysis of constraints by asking \nthe question, \"What is it in me that is holding me back",
    "skill that sets the speed at \nwhich you achieve your personal goals. \n67 \nSuccessful people always begin the analysis of constraints by asking \nthe question, \"What is it in me that is holding me back?\" They accept \ncomplete responsibility and look to themselves for both the cause and \ncure of their problems.  \nKeep asking, \"What sets the speed at which I get the results I want?\" \nThe definition of the constraint determines the strategy that you use \nto alleviate it. The failure to identify the correct constraint, or the \nidentification of the wrong constraint, can lead you off in the wrong \ndirection. You can end up solving the wrong problem.  \nA major corporation, a client of mine, was experiencing declining \nsales. They concluded that the major constraint was the sales force \nand sales",
    "irection. You can end up solving the wrong problem.  \nA major corporation, a client of mine, was experiencing declining \nsales. They concluded that the major constraint was the sales force \nand sales management. They spent an enormous amount of money \nreorganizing the management and retraining the salespeople.  \nThey later found that the primary reason that their sales were down \nwas a mistake made by an accountant that had accidentally priced \ntheir products too high relative to their competition in the \nmarketplace.  Once they revamped their pricing, their sales went \nback up and they returned to profitability. \nBehind every constraint or chokepoint, once it is located and \nalleviated successfully, you will find another constraint or limiting \n68 \nfactor. Whether it is getting to work on",
    "ed to profitability. \nBehind every constraint or chokepoint, once it is located and \nalleviated successfully, you will find another constraint or limiting \n68 \nfactor. Whether it is getting to work on time in the morning, or \nbuilding a successful career, there are always limiting factors and \nbottlenecks that set the speed of your progress. Your job is to find \nthem and to focus your energies on alleviating them as quickly as \npossible.  \nOften, starting off your day with the removal of a key bottleneck or \nconstraint fills you full of energy and personal power. It propels you \ninto following through and completing the job. And there is always \nsomething. Often a key constraint or limiting factor is the most \nimportant frog you could eat at that moment.  \nEat That Frog! Identify your most",
    "through and completing the job. And there is always \nsomething. Often a key constraint or limiting factor is the most \nimportant frog you could eat at that moment.  \nEat That Frog! Identify your most important goal in life today. What \nis it? What one goal, if you achieved it, would have the greatest \npositive effect on your life? What one career accomplishment would \nhave the greatest positive impact on your worklife? \nOnce you are clear about your major goal, ask yourself, “What sets \nthe speed at which I accomplish this goal? Why don’t I have it \nalready? What is it in me that is holding me back?” Whatever your \nanswers, take action immediately. Do something. Do anything, but \nget started. \n69 \nChapter 12- Take It One Oil Barrel at A Time \n“Persons with comparatively moderate powers wi",
    "e back?” Whatever your \nanswers, take action immediately. Do something. Do anything, but \nget started. \n69 \nChapter 12- Take It One Oil Barrel at A Time \n“Persons with comparatively moderate powers will accomplish much if they \napply themselves wholly and indefatigably to one thing at a time.” \n(Samuel Smiles) \nThere is an old saying that, \"By the yard it's hard; but inch by inch, \nanything's a cinch!\" \nOne of the best ways to overcome procrastination is for you to get \nyour mind off the huge task in front of you and focus on a single \naction that you can take. One of the best ways to eat a large frog is for \nyou to take it one bite at a time. \nConfucius wrote that, \"A journey of a thousand leagues begins with a \nsingle step.\" This is a great strategy for overcoming procrastination \nand ge",
    "rge frog is for \nyou to take it one bite at a time. \nConfucius wrote that, \"A journey of a thousand leagues begins with a \nsingle step.\" This is a great strategy for overcoming procrastination \nand getting more things done faster. \nMany years ago I crossed the heart of the Sahara Desert, the \nTenezerouft, deep in modern day Algeria. By that time, the desert \nhad been abandoned by the French for years and the original \nrefueling stations were empty and shuttered.  \n70 \nThe desert was 500 miles across in a single stretch, without water, \nfood, a blade of grass or even a fly. It was totally flat, like a broad \nyellow, sand parking lot that stretched to the horizon in all directions. \nMore than 1300 people had perished in the crossing of that stretch of \nthe Sahara in previous years. Often dri",
    "like a broad \nyellow, sand parking lot that stretched to the horizon in all directions. \nMore than 1300 people had perished in the crossing of that stretch of \nthe Sahara in previous years. Often drifting sands had obliterated the \ntrack across the desert and the travelers had gotten lost in the night. \nTo counter this lack of features in the terrain, the French had marked \nthe track with black, 55 gallon oil drums, five kilometers apart, at \nexactly the curvature of the earth as you crossed that flat wasteland. \nBecause of this, wherever you were in the daytime, you could see two \noil barrels, the one you had just passed and the one five kilometers \nahead. And that was enough. \nAll you had to do was to steer for the next oil barrel. As a result, we \nwere able to cross the biggest desert",
    "s, the one you had just passed and the one five kilometers \nahead. And that was enough. \nAll you had to do was to steer for the next oil barrel. As a result, we \nwere able to cross the biggest desert in the world by simply taking it \n“one oil barrel at a time.” \nIn the same way, you can accomplish the biggest task in your life by \ndisciplining yourself to take it just one step at a time. Your job is to go \nas far as you can see. You will then see far enough to go further. \n71 \nTo accomplish a great task, you must step out in faith and have \ncomplete confidence that your next step will soon become clear to \nyou. Remember the wonderful advice, \"Leap — and the net will \nappear!\" \nA great life, a great career is built by performing one task at a time, \nquickly and well. And then going on to th",
    "ome clear to \nyou. Remember the wonderful advice, \"Leap — and the net will \nappear!\" \nA great life, a great career is built by performing one task at a time, \nquickly and well. And then going on to the next task. \nFinancial independence is achieved by saving a little money every \nsingle month, year after year. Health and fitness are accomplished by \njust eating a little less and exercising a little more, day after day and \nmonth after month. \nYou can overcome procrastination and accomplish extraordinary \nthings by just taking the first step, by getting started toward your \ngoal and by then taking it one step, one oil barrel at a time. \nEat That Frog!  Select any goal, task or project in your life where you \nhave been procrastinating and take just one step toward \naccomplishing it immediate",
    "ing it one step, one oil barrel at a time. \nEat That Frog!  Select any goal, task or project in your life where you \nhave been procrastinating and take just one step toward \naccomplishing it immediately. Sometimes, all you need to do to get \nstarted is to sit down and make a list of all the steps you will need to \ntake to eventually complete the task. \nThen, just start and complete one item on the list. And then one more, \nand so on. You will be amazed at what you eventually accomplish.  \n72 \n      Chapter 13 - Put the Pressure on Yourself \n“The first requisite for success is to apply your physical and mental energies \nto one problem incessantly without growing weary.” \n(Thomas Edison) \nThe world is full of people who are waiting for someone to come \nalong and motivate them to be the kind",
    "sical and mental energies \nto one problem incessantly without growing weary.” \n(Thomas Edison) \nThe world is full of people who are waiting for someone to come \nalong and motivate them to be the kind of people they wish they \ncould be. The problem is that, \"No one is coming to the rescue.\" \nThese people are waiting for a bus on a street where no busses pass. \nAs a result, if they don't take charge of their lives and put the \npressure on themselves, they can end up waiting forever. And that is \nwhat most people do. \nOnly about 2% of people can work entirely without supervision. We \ncall these people \"leaders.\" This is the kind of person you are meant \nto be. \nYour job is to form the habit of putting the pressure on yourself, and \nnot waiting for someone else to come along and do it for you.",
    "eople \"leaders.\" This is the kind of person you are meant \nto be. \nYour job is to form the habit of putting the pressure on yourself, and \nnot waiting for someone else to come along and do it for you. You \nmust choose your own frogs and then make yourself eat them in their \norder of importance. \n73 \nThe standards you set for your own work and behavior should be \nhigher than anyone else could set for you. \nMake it a game with yourself to start a little earlier, work a little \nharder and stay a little later. Always look for ways to go the extra \nmile, to do more than you are paid for. \nYour self-esteem, the core of your personality, has been defined by \nthe psychologist Nathaniel Brandon as “your reputation with \nyourself.\" \nYou build up or pull down your reputation with yourself with \nevery",
    "-esteem, the core of your personality, has been defined by \nthe psychologist Nathaniel Brandon as “your reputation with \nyourself.\" \nYou build up or pull down your reputation with yourself with \neverything you do, or fail to do. The good news is that you feel \nterrific about yourself whenever you push yourself to do your best, \nwhenever you go beyond where the average person would normally \nquit. \nImagine each day that you have just received an emergency message \nand that you will have to leave town tomorrow for a month. If you \nhad to leave town for a month, what would you absolutely make sure \ngot done before you left? Whatever it is, go to work on that task right \nnow.  \nImagine that you just received all-expenses paid vacation as a prize, \nbut you will have to leave tomorrow morning on",
    "e \ngot done before you left? Whatever it is, go to work on that task right \nnow.  \nImagine that you just received all-expenses paid vacation as a prize, \nbut you will have to leave tomorrow morning on the vacation or it \n74 \nwill be given to someone else. What would you be determined to get \nfinished before you left so that you could take that vacation? \nWhatever it is, start on that one job immediately. \nSuccessful people continually put the pressure on themselves to \nperform at high levels. Unsuccessful people have to be instructed and \nsupervised and pressured by others.  \nOne of the great ways for you to overcome procrastination is by \nworking as though you only had one day to get all your most \nimportant jobs done before you left for a month or went on vacation. \nBy putting the pressu",
    "ways for you to overcome procrastination is by \nworking as though you only had one day to get all your most \nimportant jobs done before you left for a month or went on vacation. \nBy putting the pressure on yourself, you accomplish more and better \ntasks, faster than ever before. You become a high performance, high\nachieving personality. You feel terrific about yourself, and bit by bit, \nyou build up the habit of rapid task completion that then goes on to \nserve you all the days of your life. \nEat That Frog!  Set deadlines and sub-deadlines on every task and \nactivity. Create your own “forcing system.” Raise the bar on yourself \nand don’t let yourself off the hook. Once you’ve set yourself a \ndeadline, stick to it and even try to beat it. \nWrite out every step of a major job or project befo",
    "system.” Raise the bar on yourself \nand don’t let yourself off the hook. Once you’ve set yourself a \ndeadline, stick to it and even try to beat it. \nWrite out every step of a major job or project before you begin. Then \ndetermine how many minutes and hours you will require to \n75 \ncomplete each phase. Organize your daily and weekly calendars to \ncreate time segments when you work exclusively on these tasks.  \nChapter 14 - Maximize Your Personal Powers \n“Gather in your resources, rally all your faculties, marshal all your energies, \nfocus all your capacities upon mastery of at least one field of endeavor.” \n(John Haggai) \nThe raw material of personal performance and productivity is \ncontained in your physical, mental and emotional energies. \nWhen you are fully rested, you can get two times,",
    "f endeavor.” \n(John Haggai) \nThe raw material of personal performance and productivity is \ncontained in your physical, mental and emotional energies. \nWhen you are fully rested, you can get two times, three times and \nfive times as much done as when you are tired out. \nYour body is like a machine that uses food, water and rest to generate \nenergy that you then use to accomplish important tasks in your life \nand work. \nOne of the most important requirements for being happy and \nproductive is for you to guard and nurture your energy levels at all \ntimes.  \n76 \nThe rule is that your productivity begins to decline after eight or nine \nhours of work. For this reason, working long hours into the night, \nalthough it is sometimes necessary, means that you are usually \nproducing less and less in mo",
    "begins to decline after eight or nine \nhours of work. For this reason, working long hours into the night, \nalthough it is sometimes necessary, means that you are usually \nproducing less and less in more and more time. The more tired you \nget, the worse is your work and the more mistakes you make. At a \ncertain point, like a battery that is run down, you can reach “the \nwall” and simply be unable to continue. \nThe fact is that you have specific times during the day when you are \nat your best. You need to identify these times and discipline yourself \nto use them on your most important and challenging tasks. \nMost people are at their best in the mornings, after a good night's \nsleep. Some people are better in the afternoons. A few people are \nmost creative and productive in the evenings or la",
    "nging tasks. \nMost people are at their best in the mornings, after a good night's \nsleep. Some people are better in the afternoons. A few people are \nmost creative and productive in the evenings or late at night. \nA major reason for procrastination is fatigue, or attempting to start \non a task when you are tired out. You have no energy or enthusiasm. \nLike a cold engine in the morning, you can't seem to get yourself \nstarted. \nWhenever you feel overtired and overwhelmed with too much to do \nand too little time, stop yourself and just say, \"All I can do is all I can \ndo.\" \n77 \nSometimes the very best use of your time is to go home early and go \nto bed and sleep for ten hours straight. This can completely recharge \nyou and enable you to get two or three times as much done the \nfollowing day,",
    "y best use of your time is to go home early and go \nto bed and sleep for ten hours straight. This can completely recharge \nyou and enable you to get two or three times as much done the \nfollowing day, and of a far higher quality, than if you had continued \nworking long into the night. \nAccording to many researchers, the average American is not getting \nenough sleep relative to the amount of work he or she is doing. \nMillions of Americans are working in a state of mental fog as the \nresult of working too much and sleeping too little. \n One of the smartest things you can do is to turn off the television and \nget to bed by ten o'clock each night during the week. Sometimes, one \nextra hour of sleep per night can change your entire life. \nHere is a rule for you. Take one full day off every week",
    "levision and \nget to bed by ten o'clock each night during the week. Sometimes, one \nextra hour of sleep per night can change your entire life. \nHere is a rule for you. Take one full day off every week. During this \nday, either Saturday or Sunday, you absolutely refuse to read, clear \ncorrespondence, catch up on things from the office or do anything \nelse that taxes your brain. Instead, you go to a movie, exercise, spend \ntime with your family, go for a walk or any activity that allows your \nbrain to completely recharge itself. It is true that “a change is as good \nas a rest.” \n78 \nTake regular vacations each year, both long weekends and one and \ntwo-week breaks to rest and rejuvenate. You are always the most \nproductive after a weekend or a vacation. \nGoing to bed early five nights a week,",
    "vacations each year, both long weekends and one and \ntwo-week breaks to rest and rejuvenate. You are always the most \nproductive after a weekend or a vacation. \nGoing to bed early five nights a week, sleeping in on the weekends \nand taking one full day off each week will assure that you have far \nmore energy. This added energy will enable you to overcome \nprocrastination and get started on your major tasks faster and with \ngreater resolve than you ever could if you were tired out. \nIn addition, to keep your energy levels at their highest, be careful \nabout what you eat. Start the day with a high protein, low fat and \nlow carbohydrate breakfast. Eat salads with fish or chicken at lunch. \nAvoid sugar, salt, white flour products or deserts. Avoid soft drinks \nand candy bars or pastries. Feed",
    "igh protein, low fat and \nlow carbohydrate breakfast. Eat salads with fish or chicken at lunch. \nAvoid sugar, salt, white flour products or deserts. Avoid soft drinks \nand candy bars or pastries. Feed yourself as you would feed a world \nclass athlete before a competition, because in many respects, that’s \nwhat you are before starting work each day. \nBy eating lean and healthy, exercising regularly and getting lots of \nrest, you'll get more and better work done, easier and with greater \nsatisfaction than ever before.  \nThe better you feel when you start work, the less you procrastinate \nand the more eager you are to get the job done and get on with other \ntasks. High energy levels are indispensable to higher levels of \n79 \nproductivity, more happiness and greater success in everything you",
    "more eager you are to get the job done and get on with other \ntasks. High energy levels are indispensable to higher levels of \n79 \nproductivity, more happiness and greater success in everything you \ndo. \nEat That Frog! Make an analysis of your current energy levels and \nyour daily health habits. Resolve today to improve your levels of \nhealth and energy by asking the following questions: \n1) What am I doing physically that I should do more of? \n2) What am I doing that I should do less of?  \n3) What am I not doing that I should start doing if I want to perform \nat my best? \n4) What am I doing today that affects my health that I should stop \ndoing altogether?  \nWhatever your answers are to these questions, take action today. \n80 \nChapter 15 - Motivate Yourself into Action \n“It is in the com",
    "today that affects my health that I should stop \ndoing altogether?  \nWhatever your answers are to these questions, take action today. \n80 \nChapter 15 - Motivate Yourself into Action \n“It is in the compelling zest of high adventure and of victory, and of creative \naction that man finds his supreme joys.” \n(Antoine de Saint-Exupery) \nTo perform at your best, you must become your own personal \ncheerleader. You must develop a routine of coaching yourself and \nencouraging yourself to play at the top of your game.  \nFully 95% of your emotions, positive or negative, are determined by \nhow you talk to yourself on a minute to minute basis. It is not what \nhappens to you but the way that you interpret the things that are \nhappening to you that determines how you feel. It is your version of \nevents t",
    "yourself on a minute to minute basis. It is not what \nhappens to you but the way that you interpret the things that are \nhappening to you that determines how you feel. It is your version of \nevents that largely determines whether they motivate or demotivate \nyou, whether they energize or de-energize you.  \nTo keep yourself motivated, you must resolve to become a complete \noptimist. You must determine to respond positively to the words, \nactions and reactions of the people and situations around you. You \nmust refuse to let the unavoidable difficulties and setbacks of daily \nlife affect your mood or emotions. \nYour level of self-esteem, how much you like and respect yourself, is \ncentral to your levels of motivation and persistence. You should talk \n81 \nto yourself positively all the time t",
    "od or emotions. \nYour level of self-esteem, how much you like and respect yourself, is \ncentral to your levels of motivation and persistence. You should talk \n81 \nto yourself positively all the time to boost your self-esteem. Say \nthings like, \"I like myself! I like myself!\" over and over until you \nbegin to believe it and behave like a person with a high performance \npersonality. \nTo keep yourself motivated, and to overcome feelings of doubt or \nfear, continually tell yourself, \"I can do it! I can do it!\" \nWhen people ask you how you are, always tell them, \"I feel terrific!\" \nNo matter how you really feel at the moment, or what is happening \nin your life, resolve to remain cheerful and upbeat. It's been said that \nyou should never share your problems with others because 80% of \npeople don",
    "u really feel at the moment, or what is happening \nin your life, resolve to remain cheerful and upbeat. It's been said that \nyou should never share your problems with others because 80% of \npeople don't care about your problems anyway, and the other 20% \nare kind of glad that you've got them in the first place. \nIn study after study, psychologists have determined that “optimism” \nis the most important quality you can develop for personal and \nprofessional success and happiness. It seems that optimists have \nthree special behaviors, all learned through practice and repetition. \nFirst, optimists look for the good in every situation. No matter what \ngoes wrong, they always look for something good or beneficial. And \nnot surprisingly, they always seem to find it. \n82 \nSecond, optimists always",
    "look for the good in every situation. No matter what \ngoes wrong, they always look for something good or beneficial. And \nnot surprisingly, they always seem to find it. \n82 \nSecond, optimists always seek the valuable lesson in every setback \nor difficulty. They believe that, ”difficulties come not to obstruct, but to \ninstruct.” They believe that each setback or obstacle contains a \nvaluable lesson they can learn and grow from, and they are \ndetermined to find it. \nThird, optimists always look for the solution to every problem. \nInstead of blaming or complaining when things go wrong, they \nbecome action oriented. They ask questions like, \"What's the \nsolution? What can we do now? What's the next step?\" \nIn addition, people who are habitually optimistic, positive and \nupbeat think and talk",
    "come action oriented. They ask questions like, \"What's the \nsolution? What can we do now? What's the next step?\" \nIn addition, people who are habitually optimistic, positive and \nupbeat think and talk continually about their goals. They think and \ntalk about the future and where they are going rather than the past \nand where they came from. They are always looking forward rather \nthan backward.  \nWhen you continually visualize your goals and ideals and talk to \nyourself in a positive way, you feel more focused and energized. You \nfeel more confident and creative. You experience a greater sense of \ncontrol and personal power.  \nAnd the more positive and motivated you feel, the more eager you \nare to get started and the more determined you are to keep going. \n83 \nEat That Frog!  Control your",
    "of \ncontrol and personal power.  \nAnd the more positive and motivated you feel, the more eager you \nare to get started and the more determined you are to keep going. \n83 \nEat That Frog!  Control your thoughts. Remember, you become what \nyou think about most of the time. Be sure that you are thinking and \ntalking about the things you want rather than the things you don’t \nwant. \nKeep your mind positive by accepting complete responsibility for \nyourself and for everything that happens to you. Refuse to criticize or \nblame others for anything. Resolve to make progress rather than \nexcuses. Keep your thoughts and your energy focused forward, on \nthe things you can do to improve your life, and let the rest go.  \n84 \nChapter 16 - Practice Creative Procrastination \n“Make time for getting big tas",
    "your thoughts and your energy focused forward, on \nthe things you can do to improve your life, and let the rest go.  \n84 \nChapter 16 - Practice Creative Procrastination \n“Make time for getting big tasks done every day. Plan your daily workload \nin advance. Single out the relatively few small jobs that absolutely must be \ndone immediately in the morning. Then go directly to the big tasks and \npursue them to completion.” \n(Boardroom Reports) \nCreative procrastination is one of the most effective of all personal \nperformance techniques. It can change your life.  \nThe fact is that you can't do everything that you have to do. You have \nto procrastinate on something! Put off eating smaller or less ugly \nfrogs. Eat the biggest and ugliest frogs before anything else. \nThe difference between high p",
    "rything that you have to do. You have \nto procrastinate on something! Put off eating smaller or less ugly \nfrogs. Eat the biggest and ugliest frogs before anything else. \nThe difference between high performers and low performers is \nlargely determined by what they choose to procrastinate on.  \nSince you must procrastinate anyway, decide today to procrastinate \non low value activities. Decide to procrastinate, outsource, delegate \nand eliminate those activities that don't make much of a contribution \nto your life in any case. Get rid of the tadpoles and focus on the frogs. \nHere is a key point. To set proper priorities, you must set \nposteriorities as well. A priority is something that you do more of and \n85 \nsooner, while a posteriority is something that you do less of and later, \nif at al",
    "To set proper priorities, you must set \nposteriorities as well. A priority is something that you do more of and \n85 \nsooner, while a posteriority is something that you do less of and later, \nif at all. \nRule: “You can only get your time and your life under control to the \ndegree to which you discontinue lower value activities.” \nOne of the most powerful of all words in time management is the \nword \"No!\" \nSay \"No\" to anything that is not a high value use of your time and \nyour life. Say it early and say it often. The fact is that you have no \nspare time. As we say, \"Your dance card is full.\"  \nFor you to do something new, you must complete or stop doing \nsomething old. Getting in requires getting out. Picking up means \nputting down. \nCreative procrastination is the act of thoughtfully and",
    "For you to do something new, you must complete or stop doing \nsomething old. Getting in requires getting out. Picking up means \nputting down. \nCreative procrastination is the act of thoughtfully and deliberately \ndeciding upon the exact things you are not going to do right now, if \never. \nMost people engage in unconscious procrastination. They \nprocrastinate without thinking about it. As a result, they \nprocrastinate on the big, hard, valuable, important tasks that can \nhave significant long-term consequences to their lives and careers. \n86 \nYou must avoid this common tendency at all costs.  \nYour job is to deliberately procrastinate on those tasks that are of low \nvalue so that you have more time for those tasks that can really make \na difference in your life and work. \nContinually revie",
    "Your job is to deliberately procrastinate on those tasks that are of low \nvalue so that you have more time for those tasks that can really make \na difference in your life and work. \nContinually review your duties and responsibilities to identify those \ntime consuming tasks and activities that you can abandon with no \nreal loss. This is an ongoing responsibility for you that never ends. \nFor example, a friend of mine, when he was single, was an avid \ngolfer. He liked to golf three and four times a week, three to four \nhours each time. \nOver a period of years, he started a business, got married and had \ntwo children. But he still played golf three to five times a week until \nhe finally realized that his time on the golf course was causing him \nenormous stress at home and at the office. It w",
    "and had \ntwo children. But he still played golf three to five times a week until \nhe finally realized that his time on the golf course was causing him \nenormous stress at home and at the office. It was only by abandoning \nmost of his golf games that he could get his life back under control. \nContinually review your life and work to find those time consuming \ntasks and activities that you can abandon with no real loss. Cut down \non television watching and spend the time saved with your family, or \nreading or exercising, or doing something that enhances your life. \n87 \nLook at your work activities and identify the tasks that you could \ndelegate or eliminate to free up more time for the work that really \ncounts. Begin today to practice creative procrastination, to set \nposteriorities whereve",
    "ies and identify the tasks that you could \ndelegate or eliminate to free up more time for the work that really \ncounts. Begin today to practice creative procrastination, to set \nposteriorities wherever and whenever you can. This decision alone \ncould change your life. \nEat That Frog!  Practice zero-based thinking on every part of your \nlife. Ask yourself continually, “If I was not doing this already, \nknowing what I now know, would I get into it again today?” \nExamine each of your personal and work activities and evaluate it \nbased on your situation today. If it is something you would not start \nup again today, knowing what you now know, it is a prime \ncandidate for abandonment or creative procrastination.  \n88 \nChapter 17 - Do the Most Difficult Task First \n“The longer I live, them more I",
    "t \nup again today, knowing what you now know, it is a prime \ncandidate for abandonment or creative procrastination.  \n88 \nChapter 17 - Do the Most Difficult Task First \n“The longer I live, them more I am certain that the great difference between \nmen, between the feeble and the powerful, between the great and the \ninsignificant, is energy -invincible determination- a purpose once fixed, and \nthen death or victory.” \n(Sir Thomas Fowell Buxton) \nOne of the best techniques for overcoming procrastination and \ngetting more things done faster is for you to start work by doing your \nmost difficult task first.  \nThis is truly, \"Eating your frog.\" It is one of the hardest and yet one of \nthe most important of all personal management skills. \nYou develop this habit by following these steps: First, a",
    "sk first.  \nThis is truly, \"Eating your frog.\" It is one of the hardest and yet one of \nthe most important of all personal management skills. \nYou develop this habit by following these steps: First, at the end of \nyour workday, or on the weekend, you make a list of everything you \nhave to do the next day.  \nYou then review this list using the ABCDE Method, combined with \nthe 80/20 Rule. \nYou then select your A-1, most important task, the job that has the \nmost serious potential consequences if you get it done or leave it \nundone. \n89 \nYou assemble everything you need to start and finish this job and lay \nit out ready for you to start work in the morning. \nYou clear your workspace completely so that you have this one, most \nimportant task, like a big frog, sitting on your desk waiting for y",
    "ob and lay \nit out ready for you to start work in the morning. \nYou clear your workspace completely so that you have this one, most \nimportant task, like a big frog, sitting on your desk waiting for you in \nthe morning. \nYou then discipline yourself to get up, get ready and then walk in, sit \ndown and start on your most difficult task, without interruptions, \nbefore you do anything else. \nYou do this repeatedly, every day for 21 days until it becomes a habit. \nWith this discipline, you will literally double your productivity in \nless than a month. \nStarting first thing in the morning with your biggest and most \nimportant task is the opposite of what most people do. This discipline \nbreaks you of the habit of procrastination and puts your future \nsquarely in your own hands. \nStarting with y",
    "biggest and most \nimportant task is the opposite of what most people do. This discipline \nbreaks you of the habit of procrastination and puts your future \nsquarely in your own hands. \nStarting with your most difficult job, or piece of the job, gives you a \njump start on the day. As a result you'll be more energized and \nproductive from then on. \n90 \nOn the days when you launch immediately into your top job, you \nwill feel better about yourself and your work than on any other day.  \nYou will personally feel more powerful, more effective, more in \ncontrol and more in charge of your life than at any other time. \nDevelop the habit of doing the most difficult task first and you'll \nnever look back. You'll become one of the most productive people of \nyour generation. \nEat That Frog!  See yourse",
    "any other time. \nDevelop the habit of doing the most difficult task first and you'll \nnever look back. You'll become one of the most productive people of \nyour generation. \nEat That Frog!  See yourself as a work in progress. Dedicate yourself to \ndeveloping the habits of high productivity by practicing them \nrepeatedly until they become automatic and easy. \nOne of the most powerful phrases you can learn and apply is, “Just \nfor today!” Don’t worry about changing yourself for your whole life. \nIf it sounds like a good idea, do it “just for today.” \n Say to yourself, “Just for today, I will plan, prepare and start on my \nmost difficult task before I do anything else.” You’ll be amazed at the \ndifference this makes in your life. \n91 \n92 \nChapter 18 - Slice and Dice the Task \n“The beginning o",
    "n, prepare and start on my \nmost difficult task before I do anything else.” You’ll be amazed at the \ndifference this makes in your life. \n91 \n92 \nChapter 18 - Slice and Dice the Task \n“The beginning of a habit is like an invisible thread, but every time we \nrepeat the act we strengthen the strand, add to it another filament, until it \nbecomes a great cable and binds us irrevocably in thought and act.” \n(Orison Swett Marden \nA major reason for procrastinating on big, important tasks is that \nthey appear so large and formidable when you first approach them. \nOne technique that you can use to cut a big task down to size is the \n\"Salami slice\" method of getting work done. \nWith this method, you lay out the task in detail and then resolve to \ndo just one slice of the job for the time being, lik",
    "a big task down to size is the \n\"Salami slice\" method of getting work done. \nWith this method, you lay out the task in detail and then resolve to \ndo just one slice of the job for the time being, like eating a roll of \nsalami, one slice at a time. Or like eating one piece of a frog at a time. \nPsychologically, you will find it easier to do a single, small piece of a \nlarge project than to start on the whole job. \nOften, once you have started and completed a single part of the job, \nyou will feel like doing just one more \"slice.\" \nSoon, you will find yourself working through the job one part at a \ntime, and before you know it, the job will be completed.  \n93 \nAn important point to remember is that you have deep within you an \n\"urge to completion\" or what is often referred to as a \"compulsi",
    "t a \ntime, and before you know it, the job will be completed.  \n93 \nAn important point to remember is that you have deep within you an \n\"urge to completion\" or what is often referred to as a \"compulsion to \nclosure.\" \nThis means that you actually feel happier and more powerful when \nyou start and complete a task of any kind. You satisfy a deep \nsubconscious need to bring finality to a job or project. This sense of \ncompletion or closure motivates you to start into the next task or \nproject and then to persist toward final completion. This act of \ncompletion triggers that release of endorphins in your brain that we \ntalked about earlier.  \nAnd the bigger the task you start and complete, the better and more \nelated you feel. The bigger the frog you eat, the greater the surge of  \npersonal po",
    "in your brain that we \ntalked about earlier.  \nAnd the bigger the task you start and complete, the better and more \nelated you feel. The bigger the frog you eat, the greater the surge of  \npersonal power and energy you will experience. \nWhen you start and finish a small piece of a task, you feel motivated \nto start and finish another part, and then another, and so on. Each \nsmall step forward energizes you. You develop an inner drive that \nmotivates you to carry through to completion. This completion gives \nyou the great feeling of happiness and satisfaction that accompanies \nany success. \n94 \nAnother technique you can use to get yourself going is called the \n\"Swiss cheese\" method of working. You use this technique to get \nyourself into gear by resolving to punch a hole into the task, like",
    "Another technique you can use to get yourself going is called the \n\"Swiss cheese\" method of working. You use this technique to get \nyourself into gear by resolving to punch a hole into the task, like a \nhole in a block of Swiss Cheese. \nYou Swiss cheese a task when you resolve to work for a specific time \nperiod on a task. This may be as little as five or ten minutes, after \nwhich you will stop and do something else. You will just take one \nbite of your frog and then rest, or do something else. \nThe power of this method is similar to the salami slice method. Once \nyou start working, you develop a sense of forward momentum and a \nfeeling of accomplishment. You become energized and excited. You \nfeel yourself internally motivated and propelled to keep going until \nthe task is complete. \nYou",
    "op a sense of forward momentum and a \nfeeling of accomplishment. You become energized and excited. You \nfeel yourself internally motivated and propelled to keep going until \nthe task is complete. \nYou should try the \"Salami Slice\" or the \"Swiss cheese\" method on \nany task that seems overwhelming when you approach it for the first \ntime. You will be amazed at how helpful these techniques are in \novercoming procrastination.  \nI have several friends who have become best selling authors by \nsimply resolving to write one page, or even one paragraph per day \nuntil the book was completed. And you can do the same. \n95 \nEat That Frog!  Put these techniques into action immediately. Take a \nlarge, complex, multi-task job that you’ve been putting off and either \n“salami slice” or “Swiss cheese” it to",
    "do the same. \n95 \nEat That Frog!  Put these techniques into action immediately. Take a \nlarge, complex, multi-task job that you’ve been putting off and either \n“salami slice” or “Swiss cheese” it to get started. \nA common quality of successful, happy people is that they are action\noriented. When they hear a good idea, they take action on it \nimmediately to see if it can help them. Don’t delay. Try it today! \n96 \nChapter 19 - Create Large Chunks of Time \n“Nothing can add more power to your life than concentrating all of your \nenergies on a limited set of targets.” \n(Nido Qubein) \nThis strategy requires a commitment from you to work at scheduled \ntimes on large tasks. Most of the really important work you do \nrequires large chunks of unbroken time to complete. Your ability to \ncreate and ca",
    "requires a commitment from you to work at scheduled \ntimes on large tasks. Most of the really important work you do \nrequires large chunks of unbroken time to complete. Your ability to \ncreate and carve out these blocks of high value, highly productive \ntime, is central to your ability to make a significant contribution to \nyour work and to your life. \nSuccessful salespeople set aside a specific time period each day to \nphone prospects. Rather than procrastinating or delaying on a task \nthat they don’t particularly like, they resolve that they will phone for \none solid hour between 10 and 11 AM and they then discipline \nthemselves to follow through on their resolutions. \nMany business executives set aside a specific time each day to call \ncustomers directly to get feedback.  \nSome people",
    "AM and they then discipline \nthemselves to follow through on their resolutions. \nMany business executives set aside a specific time each day to call \ncustomers directly to get feedback.  \nSome people allocate specific 30-60 minute time periods each day for \nexercise. Many people read in the great books 15 minutes each night \n97 \nbefore retiring. In this way, over time, they eventually read dozens of \nthe best books ever written. \nThe key to the success of this method of working in specific time \nsegments is for you to plan your day in advance and specifically \nschedule a fixed time period for a particular activity or task. \nYou make work appointments with yourself and then discipline \nyourself to keep them. You set aside thirty, sixty and ninety minute \ntime segments that you use to work o",
    "a particular activity or task. \nYou make work appointments with yourself and then discipline \nyourself to keep them. You set aside thirty, sixty and ninety minute \ntime segments that you use to work on and complete important tasks. \nMany highly productive people schedule specific activities in \npreplanned time slots all day long. These people build their work \nlives around accomplishing key tasks one at a time. As a result, they \nbecome more and more productive and eventually produce two \ntimes, three times and five times as much as the average person. \nA time planner, broken down by day, hour and minute, organized in \nadvance, can be one of the most powerful, personal productivity \ntools of all. It enables you to see where you can consolidate and \ncreate blocks of time for concentrated wo",
    "and minute, organized in \nadvance, can be one of the most powerful, personal productivity \ntools of all. It enables you to see where you can consolidate and \ncreate blocks of time for concentrated work. \nDuring this working time, you turn off the telephone, eliminate all \ndistractions and work non-stop. One of the best work habits of all is \nfor you to get up early and work at home in the morning for several \n98 \nhours. You can get three times as much work done at home without \ninterruptions as you ever could in a busy office where you are \nsurrounded by people and bombarded by phone calls. \nWhen you fly on business, you can create your office in the air by \nplanning your work thoroughly before you depart. When the plane \ntakes off, you can work non-stop for the entire flight. You will be",
    "When you fly on business, you can create your office in the air by \nplanning your work thoroughly before you depart. When the plane \ntakes off, you can work non-stop for the entire flight. You will be \namazed at how much work you can go through when you work \nsteadily in an airplane, without interruptions. \nOne of the keys to high levels of performance and productivity is for \nyou to make every minute count. Use travel and transition time, what \nis often called \"gifts of time\" to complete small chunks of larger tasks.  \nRemember, the pyramids were built one block at a time. A great life \nand a great career is built one task, and often, one part of a task, at a \ntime. Your job in time management is to deliberately and creatively \norganize the concentrated time periods you need to get your k",
    "great career is built one task, and often, one part of a task, at a \ntime. Your job in time management is to deliberately and creatively \norganize the concentrated time periods you need to get your key jobs \ndone well, and on schedule. \nEat That Frog!  Think continually of different ways that you can save, \nschedule and consolidate large chunks of time. Use this time to work \non important tasks with the most significant long-term consequences. \n99 \nMake every minute count. Work steadily and continuously without \ndiversion or distraction by planning and preparing your work in \nadvance. Most of all, keep focused on the most important results for \nwhich you are responsible. \n100\nChapter 20 - Develop A Sense of Urgency \n“Do not wait; the time will never be ‘just right.’ Start where you stand,",
    "all, keep focused on the most important results for \nwhich you are responsible. \n100\nChapter 20 - Develop A Sense of Urgency \n“Do not wait; the time will never be ‘just right.’ Start where you stand, and \nwork with whatever tools you may have at your command, and better tools \nwill be found as you go along.” \n(Napoleon Hill) \nPerhaps the most outwardly identifiable quality of a high performing \nman or woman is \"action orientation.\" \nHighly productive people take the time to think, plan and set \npriorities. They then launch quickly and strongly toward their goals \nand objectives. They work steadily, smoothly and continuously and \nseem to go through enormous amounts of work in the same time \nperiod that the average person spends socializing, wasting time and \nworking on low value activities",
    "adily, smoothly and continuously and \nseem to go through enormous amounts of work in the same time \nperiod that the average person spends socializing, wasting time and \nworking on low value activities. \nWhen you work on high value tasks at a high and continuous level of \nactivity, you can actually enter into an amazing mental state called \n\"flow.\" Almost everyone has experienced this at some time. Really \nsuccessful people are those who get themselves into this state far \nmore often than the average. \n101\nIn the state of \"flow,\" which is the highest human state of \nperformance and productivity, something almost miraculous \nhappens to your mind and emotions. \nYou feel elated and clear. Everything you do seems effortless and \naccurate. You feel happy and energized. You experience a \ntremendo",
    ", something almost miraculous \nhappens to your mind and emotions. \nYou feel elated and clear. Everything you do seems effortless and \naccurate. You feel happy and energized. You experience a \ntremendous sense of calm and personal effectiveness. \nIn the state of \"flow,\" identified and talked about over the centuries, \nyou actually function on a higher plane of clarity, creativity and \ncompetence. You are more sensitive and aware. Your insight and \nintuition functions with incredible precision. You see the \ninterconnectedness of people and circumstances around you. You \noften come up with brilliant ideas and insights that enable you to \nmove ahead even more rapidly. \nOne of the ways you can trigger this state of flow is by developing a \n\"sense of urgency.” This is an inner drive and desire t",
    "ant ideas and insights that enable you to \nmove ahead even more rapidly. \nOne of the ways you can trigger this state of flow is by developing a \n\"sense of urgency.” This is an inner drive and desire to get on with \nthe job quickly and get it done fast. This inner drive is an impatience \nthat motivates you to get going and to keep going. A sense of \nurgency feels very much like racing against yourself.  \nWith this ingrained sense of urgency, you develop a \"bias for action.\" \nYou take action rather than talking continually about what you are \ngoing to do. You focus on specific steps you can take immediately. \n102\nYou concentrate on the things you can do right now to get the results \nyou want and achieve the goals you desire. \nFast tempo seems to go hand in hand with all great success. \nDevel",
    "immediately. \n102\nYou concentrate on the things you can do right now to get the results \nyou want and achieve the goals you desire. \nFast tempo seems to go hand in hand with all great success. \nDeveloping this tempo requires that you start moving and keep \nmoving at a steady rate. \nWhen you become an action-oriented person, you activate the \n\"Momentum Principle” of success.  This principle says that although \nit may take tremendous amounts of energy to overcome inertia and \nget going initially, it then takes far less energy to keep going. \nThe good news is that the faster you move, the more energy you \nhave. The faster you move, the more you get done and the more \neffective you feel. The faster you move, the more experience you get \nand the more you learn. The faster you move, the more co",
    "nergy you \nhave. The faster you move, the more you get done and the more \neffective you feel. The faster you move, the more experience you get \nand the more you learn. The faster you move, the more competent \nand capable you become at your work. \nA sense of urgency shifts you automatically onto the fast track in \nyour career. The faster you work and the more you get done, the \nhigher will be your levels of self-esteem, self-respect and personal \npride. \n103\nOne of the simplest and yet most powerful ways to get yourself \nstarted is to repeat the words, \"Do it now! Do it now! Do it now!\" \nover and over to yourself. \nIf you feel yourself slowing or becoming distracted by conversations \nor low value activities, repeat to yourself the words, \"Back to work! \nBack to work! Back to work!\" over and",
    "nd over to yourself. \nIf you feel yourself slowing or becoming distracted by conversations \nor low value activities, repeat to yourself the words, \"Back to work! \nBack to work! Back to work!\" over and over.  \nIn the final analysis, nothing will help you more in your career than \nfor you to get the reputation for being the kind of person who gets \nimportant work done quickly and well. This reputation will make \nyou one of the most valuable and respected people in your field. \nEat That Frog!  Resolve today to develop a sense of urgency in \neverything you do. Select one area where you have a tendency to \nprocrastinate and make a decision to develop the habit of fast action \nin that area. \nWhen you see an opportunity or a problem, take action immediately. \nWhen you are given a task or responsi",
    "ency to \nprocrastinate and make a decision to develop the habit of fast action \nin that area. \nWhen you see an opportunity or a problem, take action immediately. \nWhen you are given a task or responsibility, do it quickly and report \nback fast. Move rapidly in every important area of your life. You will \nbe amazed at how much better you feel, and how much more you get \ndone.  \n104\n105\nChapter 21 - Single Handle Every Task \n“And herein lies the secret of true power. Learn, by constant practice, how to \nhusband your resources, and concentrate them, at any given moment, upon \na given point.” (James Allen)  \nEat that frog! Every bit of planning, prioritizing and organizing \ncomes down to this simple concept.  \nYour ability to select your most important task, to begin it and then to \nconcentrat",
    "es Allen)  \nEat that frog! Every bit of planning, prioritizing and organizing \ncomes down to this simple concept.  \nYour ability to select your most important task, to begin it and then to \nconcentrate on it single mindedly until it is complete is the key to \nhigh levels of performance and personal productivity. \nEvery great achievement of mankind has been preceded by a long \nperiod of hard, concentrated work until the job was done. \nSingle handling requires that once you begin, you keep working at \nthe task, without diversion or distraction, until the job is 100% \ncomplete. You keep urging yourself onward by repeating the words \n\"Back to work!\" over and over whenever you are tempted to stop or \ndo something else. \nBy concentrating single mindedly on your most important task, you \ncan redu",
    "urself onward by repeating the words \n\"Back to work!\" over and over whenever you are tempted to stop or \ndo something else. \nBy concentrating single mindedly on your most important task, you \ncan reduce the time required to complete it by 50% or more. \n106\nIt has been estimated that the tendency to start and stop a task, to \npick it up, put it down and come back to it can increase the time \nnecessary to complete the task by as much as 500%.  \nEach time you return to the task, you have to familiarize yourself \nwith where you were when you stopped and what you still have to \ndo. You have to overcome inertia and get yourself going again. You \nhave to develop momentum and get into a productive work rhythm. \nBut when you prepare thoroughly and then begin, refusing to stop or \nturn aside until t",
    "come inertia and get yourself going again. You \nhave to develop momentum and get into a productive work rhythm. \nBut when you prepare thoroughly and then begin, refusing to stop or \nturn aside until the job is done, you develop energy, enthusiasm and \nmotivation. You get better and better and more productive. You work \nfaster and more effectively.  \nThe truth is that once you have decided on your number one task, \nanything else that you do other than that is a relative waste of time. \nAny other activity is just not as valuable or as important as this job, \nbased on your own priorities.  \nThe more you discipline yourself to working non-stop on a single \ntask, the more you move down the \"Efficiency Curve.\" You get more \nand more high quality work done in less and less time. \n107\nEach time yo",
    "ore you discipline yourself to working non-stop on a single \ntask, the more you move down the \"Efficiency Curve.\" You get more \nand more high quality work done in less and less time. \n107\nEach time you stop working however, you break this cycle and move \nback up the curve to where every part of the task is more difficult \nand time consuming. \nElbert Hubbard defined self discipline as, \"The ability to make \nyourself do what you should do, when you should do it, whether you \nfeel like it or not.\" \nIn the final analysis, success in any area requires tons of discipline. \nSelf-discipline, self-mastery and self-control are the basic building \nblocks of character and high performance. \nStarting a high priority task and persisting with that task until it is \n100% complete is the true test of your",
    "ery and self-control are the basic building \nblocks of character and high performance. \nStarting a high priority task and persisting with that task until it is \n100% complete is the true test of your character, your willpower and \nyour resolve. \nPersistence is actually self-discipline in action. The good news is that \nthe more you discipline yourself to persist on a major task, the more \nyou like and respect yourself, and the higher is your self-esteem. \nAnd the more you like and respect yourself, the easier it is for you to \ndiscipline yourself to persist even more. \n108\nBy focusing clearly on your most valuable task and concentrating \nsingle mindedly until it is 100% complete, you actually shape and \nmold your own character. You become a superior person. \nYou become a stronger, more comp",
    "n your most valuable task and concentrating \nsingle mindedly until it is 100% complete, you actually shape and \nmold your own character. You become a superior person. \nYou become a stronger, more competent, confident and happier \nperson. You feel more powerful and productive. \nYou eventually feel capable of setting and achieving any goal. You \nbecome the master of your own destiny. You place yourself on an \nascending spiral of personal effectiveness on which your future is \nabsolutely guaranteed. \nAnd the key to all of this is for you to determine the most valuable \nand important thing you could possibly do at every single moment \nand then, \"Eat That Frog!\" \nEat That Frog!  Take action! Resolve today to select the most \nimportant task or project that you could complete and then launch \nint",
    "ld possibly do at every single moment \nand then, \"Eat That Frog!\" \nEat That Frog!  Take action! Resolve today to select the most \nimportant task or project that you could complete and then launch \ninto it immediately. \nOnce you start your most important task, discipline yourself to \npersevere without diversion or distraction until it is 100% complete. \nSee it as a “test” to determine whether you are the kind of person \nwho can make a decision to complete something and then carry it \nout. Once you begin, refuse to stop until the job is finished. \n109\nPutting It All Together \nThe key to happiness, satisfaction, great success and a wonderful \nfeeling of persona power and effectiveness is for you to develop the \nhabit of eating your frog, first thing every day when you start work. \nFortunately",
    "s, satisfaction, great success and a wonderful \nfeeling of persona power and effectiveness is for you to develop the \nhabit of eating your frog, first thing every day when you start work. \nFortunately, this is a learnable skill that you can acquire through \nrepetition. And when you develop the habit of starting on your most \nimportant task, before anything else, your success is assured. \nHere is a summary of the 21 Great Ways to stop procrastinating and \nget more things done faster. Review these rules and principles \nregularly until they become firmly ingrained in your thinking and \nactions and your future will be guaranteed. \n1. Set the table: Decide exactly what you want. Clarity is essential. \nWrite out your goals and objectives before you begin; \n2. Plan every day in advance: Think on",
    "d your future will be guaranteed. \n1. Set the table: Decide exactly what you want. Clarity is essential. \nWrite out your goals and objectives before you begin; \n2. Plan every day in advance: Think on paper. Every minute you \nspend in planning can save you five or ten minutes in execution; \n3. Apply the 80/20 Rule to everything: Twenty percent of your \nactivities will account for eighty percent of your results. Always \nconcentrate your efforts on that top twenty percent; \n110\n4. Consider the consequences: Your most important tasks and \npriorities are those that can have the most serious consequences, \npositive or negative, on your life or work. Focus on these above all \nelse; \n5. Practice the ABCDE Method continually: Before you begin work \non a list of tasks, take a few moments to organize",
    "ences, \npositive or negative, on your life or work. Focus on these above all \nelse; \n5. Practice the ABCDE Method continually: Before you begin work \non a list of tasks, take a few moments to organize them by value \nand priority so you can be sure of working on your most \nimportant activities: \n6. Focus on key result areas: Identify and determine those results \nthat you absolutely, positively have to get to do your job well, and \nwork on them all day long; \n7. The Law of Forced Efficiency: There is never enough time to do \neverything but there is always enough time to do the most \nimportant things. What are they? \n8. Prepare thoroughly before you begin: Proper prior preparation \nprevents poor performance; \n9. Do  your homework: The more knowledgeable and skilled you \nbecome at your key tas",
    "ings. What are they? \n8. Prepare thoroughly before you begin: Proper prior preparation \nprevents poor performance; \n9. Do  your homework: The more knowledgeable and skilled you \nbecome at your key tasks, the faster you start them and the sooner \nyou get them done; \n10.  Leverage your special talents: Determine exactly what it is that \nyou are very good at doing, or could be very good at, and throw \nyour whole heart into doing those specific things very, very well: \n11.  Identify your key constraints: Determine the bottlenecks or \nchokepoints, internally or externally, that set the speed at which \n111\nyou achieve your most important goals and focus on alleviating \nthem; \n12.  Take it one oil barrel at a time: You can accomplish the biggest \nand most complicated job if you just complete it o",
    "ch \n111\nyou achieve your most important goals and focus on alleviating \nthem; \n12.  Take it one oil barrel at a time: You can accomplish the biggest \nand most complicated job if you just complete it one step at a time; \n13.  Put the pressure on yourself: Imagine that you have to leave \ntown for a month and work as if you had to get all your major \ntasks completed before you left; \n14.  Maximize your personal powers: Identify your periods of highest \nmental and physical energy each day and structure your most \nimportant and demanding tasks around these times. Get lots of \nrest so you can perform at your best; \n15.  Motivate yourself into action: Be your own cheerleader. Look for \nthe good in every situation. Focus on the solution rather than the \nproblem. Always be optimistic and constructi",
    "m at your best; \n15.  Motivate yourself into action: Be your own cheerleader. Look for \nthe good in every situation. Focus on the solution rather than the \nproblem. Always be optimistic and constructive; \n16.  Practice creative procrastination: Since you can’t do everything, \nyou must learn to deliberately put off those tasks that are of low \nvalue so that you have enough time to do the few things that \nreally count;  \n17.  Do the most difficult task first:  Begin each day with your most \ndifficult task,  the one task that can make the greatest contribution \nto yourself and your work, and resolve to stay at it until it is \ncomplete: \n18.  Slice and dice the task: Break large, complex tasks down into bite \nsized pieces and then just do one small part of the task to get \nstarted; \n112\n19.  C",
    "lve to stay at it until it is \ncomplete: \n18.  Slice and dice the task: Break large, complex tasks down into bite \nsized pieces and then just do one small part of the task to get \nstarted; \n112\n19.  Create large chunks of time: Organize your days around large \nblocks of time where you can concentrate for  extended periods on \nyour most important tasks; \n20.  Develop a sense of urgency: Make a habit of moving fast on your \nkey tasks. Become known as a person who does things quickly \nand well; \n21.  Single handle every task: Set clear priorities, start immediately \non your most important task and then work without stopping \nuntil the job is 100% complete. This is the real key to high \nperformance and maximum personal productivity. \nMake a decision to practice these principles every day until",
    "d then work without stopping \nuntil the job is 100% complete. This is the real key to high \nperformance and maximum personal productivity. \nMake a decision to practice these principles every day until they \nbecome second nature to you. With these habits of personal \nmanagement as a permanent part of your personality, your future \nwill be unlimited. \nJust do it! Eat that frog. \n113"
  ],
  "metadatas": [
    {
      "source": "docs\\osho.txt",
      "chunk_index": 0,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 1,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 2,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 3,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 4,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 5,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 6,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 7,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 8,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 9,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 10,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 11,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 12,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 13,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 14,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 15,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 16,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 17,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 18,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 19,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 20,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 21,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 22,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 23,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 24,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 25,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 26,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 27,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 28,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 29,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 30,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 31,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 32,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 33,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 34,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 35,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 36,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 37,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 38,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 39,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 40,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 41,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 42,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 43,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 44,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 45,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 46,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 47,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 48,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 49,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 50,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 51,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 52,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 53,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 54,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 55,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 56,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 57,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 58,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 59,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 60,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 61,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 62,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 63,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 64,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 65,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 66,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 67,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 68,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 69,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 70,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 71,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 72,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 73,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 74,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 75,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 76,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 77,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 78,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 79,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 80,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 81,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 82,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 83,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 84,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 85,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 86,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 87,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 88,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 89,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 90,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 91,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 92,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 93,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 94,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 95,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 96,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 97,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 98,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 99,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 100,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 101,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 102,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 103,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 104,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 105,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 106,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 107,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 108,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 109,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 110,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 111,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 112,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 113,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 114,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 115,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 116,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 117,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 118,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 119,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 120,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 121,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 122,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 123,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 124,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 125,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 126,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 127,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 128,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 129,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 130,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 131,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 132,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 133,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 134,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 135,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 136,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 137,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 138,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 139,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 140,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 141,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 142,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 143,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 144,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 145,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 146,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 147,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 148,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 149,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 150,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 151,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 152,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 153,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 154,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 155,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 156,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 157,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 158,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 159,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 160,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 161,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 162,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 163,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 164,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 165,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 166,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 167,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 168,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 169,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 170,
      "char_len": 798
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 171,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 172,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 173,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 174,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 175,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 176,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 177,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 178,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 179,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 180,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 181,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 182,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 183,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 184,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 185,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 186,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 187,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 188,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 189,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 190,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 191,
      "char_len": 799
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 192,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 193,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 194,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 195,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 196,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 197,
      "char_len": 800
    },
    {
      "source": "docs\\osho.txt",
      "chunk_index": 198,
      "char_len": 383
    }
  ]
}